{"songs": [{"title": "I’m Thuggin’", "album": null, "year": "2017-11-10", "lyrics": "Interlude :\nJayZ come out & play\nAyo Assassin give me one of them tracks\nSo i can ride on them motherfuckers\nMobb Deep , motherfuckers talking about\nWe can't rap\n\nVerse01 :\nI'm gettin' suspicious of this bitch\nThe line's busy everytime I call her\nNow she's tellin' me to visit, who else is home?\nI check the house before I bone, so we all alone\nAfter I nut I hit the highway -- see ya later!\nTo all the players, watch the fly way a nigga played her\nThe bitch is tellin' all her homies\nThat I can fuck her like no other\nNow them other bitches wanna bone me\nI'm under pressure, gettin' drunk, somebody help me\nI drink a fifth of Hennessy, I don't think it's healthy\nI see my enemies, they creepin', don't make me blast\nI watch the 5-0's roll, the motherfuckers pass\nBy me like they know me, smilin' as they laugh\nI put up my middle finger, then I dash\nNiggas don't like me, ‘cause I'm thuggin'\nAnd every day I'm a hustler lookin' to get paid\n\nChorus :\nNiggas don't like me, ‘cause I'm thuggin'\nAyo\nAre you afraid to die, or do you wanna live forever?\nTell me, which one?\nNiggas don't like me, ‘cause I'm thuggin'\nAyo\nAre you afraid to die, or do you wanna live forever?\nTell me, which one?\nNiggas don't like me, ‘cause I'm thuggin'\nAyo\nAyo\nAyo\n\nVerse02 :\nFallin' to pieces, am I guilty? I pray to the Lord\nBut he ignores me, unfortunately, ‘cause I'm guilty\nShow me a miracle, I'm hopeless\nI'm chokin' off marijuana smoke\nWith every toke it's like I'm losin' focus\nFallin' to sleep while I'm at service, when will I die?\nForever paranoid and nervous, because I'm high\nDon't mention funerals, I'm stressin' and goin' nutty\nAnd reminiscin' 'bout them niggas that murdered my buddy\nI wonder: When will I be happy? Ain't nothin' funny\nFlashbacks of bustin' caps, anything for money\nWhere am I goin'? I discovered, can't nothin' save me\nMy next door neighbor's havin' convo with undercovers\nPut a surprise in the mailbox, hope she get it\nHappy birthday, bitch, you know you shouldn't have did it\nEverybody's dyin', am I next? Who can I trust?\nWill they be G's, and they look at me before they bust?", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}