{"songs": [{"title": "Slippin’ into Darkness", "album": null, "year": null, "lyrics": "Yeah! ha ha yeah.... thats right!\nThe F.A's comin striaght from the wild wild west\n\nLook at baby girl born in 19-7-deuce\nPop's on his fix, Mom's stuck on that crazy juice\nWent to school, It's all cool but in Junior Hiiigh\nLittle hooker in the bathroom getting hiiigh\nWhat she doing and what she smoking, nobody knows\nIs she addicted or just slipping into melbose\nA bad ass broad running with the girl gang\nJust got some tat's,Talking all that girl slang\nFirst one to slap, because La vida dont matter\nWip out a cuete watch your brains get splattered\nSelling them doves, hanging with thugs and all that\nBeating up fools with a baseball bat\nStarted having sex at only 14\nImagine O.G. wears his clothes all crisp and clean\nGot pregnant had a baby in December\nShe won't see the daddy till next September\nMom's and Pop's gave her the boot\nKicked her out La Casa, Now what Raza\nWith the money she got, She bought a spot of the block\nStarted paying the rent by slangin' phat ass coca rocks\nNow shes 23 her four kids all alone, and loc'ed out\nAnd plus shes all smoked out,the base face\nYou could see it in her eyes, it could also tell the tears\nOf a life long cries\nThey was headed for self destruction\nConjunction Junction,(hey Yo!) Whats your Function?\nHer own kids gotta healp, 'cause they knew she was slippin'\nTook the devil away homegiiirl, You was Slippin'\n\nCHORUS:\nSlipping into Darkness\nWhen you slip you trip and fall\nSlipping into Darkness\nAin't no sense to give ya'll no love at all\n\nThey say we're slipping, as a whole one race\nSo, what we gonna choose, Don't want the blues\nI turn to the news and what do I see\n(merciless)\"Everybody in the world ready to D. I. E.\"\nWe got blacks against blacks, browns against browns\nWhites against whites,from governments to undergrounds\nSo, Peep the sound as it bumps through your stereo\nEar to your brain now check out the scenerio\nCali got quakes, Mudslides, and Floods\nPesadillas(nightmares)Crips and Bloods\nHustlas, Pimps, Shot Callers, and Killas\nO.G. , Macks, and the big Coca Dealers\nWe got homeboys who just like kicking it\nAnd Vato's like me who grab the mic and start splitting it\n(merciless) \"You're in for a phat treat trip into a phat beat\"\nSo get closer to the funk and slip into the backseat\n\nCHORUS X2\n\nThey wanna band me cause a brothas makin noise a lot\nIll shoot they ass in a sec wit a poisin dart\nThey got me runnin down the street gettin hotter\nRunnin from the cops as i try to clock my Glock\nThe war won't stop\nThats why they wanna band the music\nYou ever notcie how the cops can't stand the music\nSee a black man coolin wit a mexican\nWe can all have peace, the sun sets again\nThey try to shove us in the pen\nBut we clown and we frown every time we hit the top ten\nOnce again, its your friend outta oakland,hopin\nTo keep the hip hop clubs open\nNow we can lay back and let them close'm\nOr we can have beef and show that we control'em\nNow ain't nobody gettin paid, its a damn shame\nWhy gang bang brothas in the same gang?\nThey say securitys to blame, cause they lettin it off\nBrothas come to have fun but they settin it off\nOne time, make it worse when they sweat us\nSend an army of pigs to come get us\nNow im runnin outta time and im cool down with the aztecs\nThis is sorta like soul food", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}