{"songs": [{"title": "Fire On My Target (ft. Prodigy)", "album": null, "year": "2017-01-01", "lyrics": "[Verse 1: 2Pac]\nI be a hustler til it's over, motherfucker\nThe motherfuckin' dust kicker, who can you trust?\nDo you have the heart to see a nigga, before you bust?\nMy name is spoken on the tongues of so many foes\nBustin' motherfuckers out the box, I ain't even go!\nNow how the hell do you explain, my claim to fame?\nFrom doin' flicks to bustin' tricks out the fuckin' frame\nGot these bitches on my jock, niggas on my block\nJealous ass suckers got 'em duckin' from my smokin' Glock\nAnd bustin' niggas asses to stay alive\nSkinny ass player watchin' bigger motherfuckers fry\nThey ask me how I’m livin? Haaah I’m a hustler\nBuckin' busters 'til they die\n\n[Prodigy]\nLord Forgive me\nThe Hennessy got me not knowin' how to act\nI'm fallin' and I can't turn back\nUntil my death\nYou walkin' with your head down, scared to look\nGod bless my soul\n\n[Hook]\nThey got me runnin' from the police, nowhere to go\nWith the lights out, rollin' down a dirt road\nBut I ain't goin' alive, I'd rather die than be a convict\nI'd rather fire on my target\nThey got me runnin' from the police, nowhere to go\nWith the lights out, rollin' down a dirt road\nBut I ain't goin' alive, I'd rather die than be a convict\nI'd rather fire on my target, oh shit!\n\n[Prodigy]\nWe got the illest combination of this right here man\nHa-ha, uh man, y'all runnin' out of steam already?\nThat's all y'all got man?\nThat's all y'all got man?!\n\n[Verse 2: Prodigy]\nIt go one, two, three to the fourth\nThat nigga P-Double got that shit for y'alls\nPeoples to rock to, stirrin' up pots of brew\nIn hell's kitchen, I chef the impossible\nTo serve hot plates all across the Unified States\nSit down and sup with the top rap reps\nWe the streets that's watchin', boy, move diligent\nYou better walk like a nigga on a tightrope do\nInfamous\nMight catch me in a burgundy chair, my shirt blockin'\nFresh with my bandanna and Timbs, we outta there\nPushin' to the limit like Montana did\nArmy bags full of money, bullet proof this\nAnd that too, put some in the roof\nNiggas be shootin' from windows, we untouchable\nYea we is rich thugs, that shoot up clubs\nMake albums that click more than little drugs\n\n[Hook]\nThey got me runnin' from the police, nowhere to go\nWith the lights out, rollin' down a dirt road\nBut I ain't goin' alive, I'd rather die than be a convict\nI'd rather fire on my target\nThey got me runnin' from the police, nowhere to go\nWith the lights out, rollin' down a dirt road\nBut I ain't goin' alive, I'd rather die than be a convict\nI'd rather fire on my target, oh shit!\n\n[Verse 3: 2Pac]\nNiggas know I ain't the one to sleep on, I'm under pressure\nGotta sleep with my piece, an extra clip beside my dresser\nWord to God I've been ready to die since I was born\nI don't want no shit but niggas trip and, yo, it's on\nOpen fire on my adversaries, don't even worry\nBetter have on a vest aim for the chest and then you buried\nIt's a man's world, niggas get played, another stray\nHope I live to see another day, hey!\nI'm gettin' sweated by these undercovers\nWho can I trust, got my mama stressin', thinkin' it's a drug bust\nGotta get paid but all the drama that's attached\nWe livin' a drug life, THUG LIFE, each day could be my last\nWill I blast when it's time to shoot? Don't even ask\nThat's the consequences when ya livin' fast\nDon't turn around I ain't givin' up, cause they don't worry me\nPussy ass bitches better bury me, bury me!\n\n[Hook]\nThey got me runnin' from the police, nowhere to go\nWith the lights out, rollin' down a dirt road\nBut I ain't goin' alive, I'd rather die than be a convict\nI'd rather fire on my target\nThey got me runnin' from the police, nowhere to go\nWith the lights out, rollin' down a dirt road\nBut I ain't goin' alive, I'd rather die than be a convict\nI'd rather fire on my target, oh shit! (x2)", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}