{"songs": [{"title": "1995 Police Station Testimony", "album": null, "year": "1995-06-28", "lyrics": "Woman – Sir, will you raise your right hand, please? Do you swear and confirm that the testimony that you are about to give is the truth, nothing but the truth, the whole truth?\n\n2Pac – I do\n\nPolice – Could you please state your full name for the record?\n\n2Pac – Yes, 2Pac Amaru Shakur\n\nPolice – What is your age and resident address?\n\n2Pac – I just turned 24 on the 16th of June. I live in Decatur, Georgia\n\nPolice – How did you get interested in music?\n\n2Pac – I started off with poetry, with writing poetry\n\nPolice – Junior High, High School?\n\n2Pac – Yes, Junior High, High School\n\n2Pac – And poets I saw when I looked on the Webs*, I did that personally, but then I started turning poetry into songs and I got more attention\n\nPolice – How did you get into rap?\n\n2Pac – It’s of my opinion that I was rapping while I was writing poetry..\n\nPolice – Okay\n\n2Pac – and so I was into rap, I guess you could say from Junior High, when I wrote my first poems. And after I heard on the radio that there were other poets, who were making records and they were selling and it was working, that’s when I decided to change the method of my poetry\n\nPolice – How do you define rap? What constitutes rap?\n\n2Pac – That’s what it is to me: poetry. To me it’s story-telling poetry\n\nPolice – To music, music with a beat?\n\n2Pac – With or without music you cannot define rap\n\nPolice – But it goes, it has sometimes a beat, a tune to it, doesn’t it, even if it hasn’t got accompaniment to it?\n\n2Pac – No, even a pentameter is rap. It’s how you write it, the structure, it depends how you write it, and as to whether it has a beat, I guess it won’t sell as much if you don’t have a beat; the beat is more of a selling tool\n\nPolice – Now, you were performing by the time you did your solo-album what people call “gangsta rap”.,\n\n2Pac – No\n\nPolice – You were not?\n\n2Pac – No!\n\nPolice – What would you call what you were performing?\n\n2Pac – Rap music!\n\nPolice – Have you ever performed gangsta rap?\n\n2Pac – No!\n\nPolice – Okay, and why would you say that?\n\n2Pac – Because, Number One, I do not know what “gangsta rap”, is, number two, I would not classify what my music is as gangsta rap\n\nPolice – Have you heard the term?\n\n2Pac – A lot!\n\nPolice – Okay\n\nPolice – The next statement is a “Victim for Real” : “I really got my ass beat, I really don’t like police”\n\n2Pac – I didn’t say that. Where were you at right there? Oh, there. I didn’t say that: that’s not what it says…It says: “I’m a victim for real, everything I talk is for real, I really got my ass beat, I really don’t like …” The interviewer wrote POLICE\n\nPolice – Did you mean ””?\n\n2Pac – No\n\nPolice – What did you mean?\n\n2Pac – I really don’t like “crooked police”\n\nPolice – Okay. So you feel okay about other police?\n\n2Pac – Feel okay?\n\nPolice – You like other police?\n\n2Pac – I like everybody that just does their job; I mean it depends on, I don’t know…. Personally, if I meet someone that is kind-hearted*, that’s true and that’s fair, then I like them, especially in a position like that, when a person has to put their life on line*, and they can still be fair to everybody they meet, I definitely like them, and I admire that..\n\nPolice – Are you aware of any others who had shot a policeman, especially teenagers who shot policemen after listening..\n\nLawyer – “after ALLEGEDLY listening”\n\nPolice – That’s right, “after allegedly listening”: they said they were listening to your music\n\n2Pac – NO\n\nPolice – and that’s what caused them to do it..\n\n2Pac – But none of them said this until you guys started saying this, they put it all over the news and had Danny Quayle* say it..\n\nPolice – I’m asking you, are you aware of any others?\n\n2Pac – No, NO!\n\nPolice – When did you first start getting fan-mail? Remember what year?\n\n2Pac – No, I don’t\n\nPolice – I hear you said you also received unfavourable mail?\n\n2Pac – Yeah, like this! I got a lot of mail from you’all..\n\nPolice – From fans?\n\n2Pac – No! From “you’all”: YOU guys, the lawyers… lawsuits*\n\nPolice – What else, did you receive unfavourable mail?\n\n2Pac – In my whole career I believe I got 5 pieces of hate mail. Of all of the mail I’ve ever gotten, I’ve gotten only about 5 pieces, maximum\n\nPolice – And did you respond to that?\n\n2Pac – I responded to your hate mail..\n\nPolice – Have you ever used illegal drugs?\n\n2Pac – Marijuana, yes\n\nPolice – Any others?\n\n2Pac – No!\n\nPolice – How often have you used marijuana?\n\n2Pac – In my whole life? At what point in my life?\n\nPolice – Let’s say from 17 on ?\n\nLawyer – I’m going to instruct the witness* not to talk about any use of or possession of illegal substances: I don’t believe that is relevant to this: He’s admitted he used it\n\nPolice – I think it’s absolutely relevant. You’re trying to make him out to be a choir boy* and I’m trying to see what he’s really done\n\nLawyer – I haven’t made him out to be anything\n\n2Pac – You’re trying to make me out to be a devil!\n\nPolice – Was it your intention to try to get young black people to be violent to police?\n\n2Pac – No\n\nPolice – Were you trying to provoke anybody to do anything particular? Were you trying to provoke or to make people to do things?\n\n2Pac – Yes!\n\nPolice – Tell us what!\n\n2Pac – Think! Use your head!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}