{"songs": [{"title": "Do What I Feel (Live 1996)", "album": "Live At The House Of Blues", "year": "2005-10-03", "lyrics": "[Chorus 1: Prince Ital]\nRespect to the Death Row Inmates\nDeath Row Inmates lawd dem never hesitate\nTo bust a gun shot, in a idiot face\nDis is Dogg Pound and your life goes to waste\n\nFree Dogg Pound territory\nDat Nigga Daz put you inna di cemetery\nSnoop Dogg, di criminal mentality\nFuck wit Dirty Kurupt and yuh dead each way\n\n[Bridge 1]\nNow the D.P.'s, if ya down with this shit say \"hell yeah\"\nPack your heat, if you equipped say \"hell yeah\"\nHit a corner, hit a switch, say \"hell yeah\"\nFuck a hoe, fuck a bitch, say \"hell yeah\"\nTo all my G's that slang, say \"hell yeah\"\nTo all my bangers that bang, say \"hell yeah\"\nNo matter where the fuck ya hang, say \"hell yeah\"\nYeah, check it out\n\n[Verse 1: Kurupt]\nNow here's the perfect mix to let it bubble and foam\nWait these seconds then watch the microphone get blown\nIt's the mischevious, lyrical genius on the loose\nAnd I pack the deuce-deuce of some act-right juice\nI'm in my own, space and time\nThe elevation of my rhymes elevates your mind\nIt's a clear blue sky and a clear blue day\nFor a G from DPG to wear clear blue and gray\nI come, I came, I am, I ain't\nThe nigga ya wants to fuck with, get peeled like paint\nBottoms up, nigga, give it all ya got\nFrom the bottom to the top or get shanked, get shot\nProvocative footage of this lyrical abuse transgression\nFrom this infectious enemy, they on a loose (What)\nAnd unstoppable, Daz\nMy motherfuckin' nigga from back in the past\n\n[Verse 2: Dat Nigga Daz]\nNow imagine yourself in a bottomless pit\nWith no way your climbin' out, and this ain't the punishment\nDeadly as crystal crack, how should I react\nWith intentions to keep on mashin', strap to strap\nIs this my boundary from county to county?\nYour homies wanna try to soak me like Bounty?\nDogg Poung Gangsta all day, all night\nPartying like a motherfuckin' now all night\nBut uhh, simple as fact I been wanting to serve your whole fucking crew\nNow what you wanna do? (What you wanna do?)\nLoad up your weapon slowly step in caught your homey straight slippin'\nYou shoulda known from the jump nigga that I was trippin'\nI gets to bustin you gets to duckin' (Blaow blaow)\nDogg Pound Gangsta gets to dippin' in the cut\nMy performance is enormous the way that I stayed up on em\nI catch em and let em have it what's up, with my opponents\nI hold it down for the two and I'll be gunned down by no one\nForever I reign, top Dogg number one\nMy rhyme to some explainable and Doggs that's untrainable\nUncontainable, my mind state's so strainable\n\n[Chorus 2]\nI'm a D.P.G.C. for life\nI do what I feel and, I do what I like (C'mon)\nI'm a D.P.G.C. for life\nI do what I feel and, I do what I like (Sing it)\nI'm a D.P.G.C. for life\nI do what I feel and, I do what I like (Fuck that)\nI'm a D.P.G.C. for life\nI do what I feel and, I do what I like\n\n[Verse 3: Kurupt]\nI hits it like shots, from the homey strap\nI smoke indo, and I sip cognac\nGive a FUCK whatcha name is, I tell ya quick\nFace to face, punk you can eat a dick\nCause you're all out of time, out of sight\nOut of mind, something I wouldn't do without a nine\nI got a pocket full of papers and a trunk full of beat\nMashing all through the streets rollin wit some heat\nI'm heated, repeat it, day after day\nDaily survival tactics in L.A\nI'm on point and alert\nWith skills like a huntin expert, fuck around and get hurt\nLurked, I puts in work like a chemist\nMentally known to cause motherfucking dilemmas\nSee me in black and beware\nIt's a Dogg Pound Gangsta on the loose out there\n\n[Bridge 2]\nYeah, it's your shit, say \"hell yeah\"\nDogg Pound gangstas say \"hell yeah\"\nWhen I roll throughout your block say \"hell yeah\"\nFor all my niggas that gang say \"hell yeah\"\n\n[Verse 4]\nIf it was on where you reside, what would you do?\nIf you looked outside and the homies came through\nWould you ride? (I ride) Would you ride (I ride)\nOr would you think or by chance the circumstances of a mark\nAnd get your ass whooped in the middle of a park?\nWould you ride? (I ride) Would you ride (I ride)\n\n[Outro]\nMotherfuckers, yeah\nYa don't doubt that Snoop\nDon't doubt that Snoop\nDon't doubt that Snoop", "image": "https://images.genius.com/aceb98afaa438b9a1b348f7296ac142f.594x594x1.jpg"}], "artist": "2Pac"}