{"songs": [{"title": "How Do U Want It (Live 1996)", "album": "Live At The House Of Blues", "year": "1996-07-04", "lyrics": "[Chorus: K-Ci & JoJo]\nHow do you want it? (C'mon!)\nHow do you feel?\nComin’ up as a nigga in the cash game\nLivin' in the fast lane, I'm for real\n(Everybody sing it!)\nHow do you want it yeah? (C’mon!)\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real (Say what?)\n\n[Verse 1: 2Pac]\nI love the way you activate your hips and push your ass out\nGot a nigga wantin' it so bad, I'm about to pass out\nWanna dig you, and I can't even lie about it\nBaby, just alleviate your clothes, time to fly up out it\nCatch you at a club, oh shit, you got me fiendin'\nBody talkin’ shit to me, but I can’t comprehend the meanin'\nNow, if you wanna roll with me, then here’s your chance\nDoin' eighty on the freeway, police, catch me if you can\nForgive me, I'm a rider, still I'm just a simple man\nAll I want is money, fuck the fame, I’m a simple man\nMr. International, player with the passport\nJust like Aladdin, bitch, get you anything you ask for\nRemember me, Champagne and Hennessy\nA favorite of my homies when we floss on our enemies\nWitness as we creep to a low speed, peep what a ho need\nPuff some mo' weed, funk, ya don't need\nApproachin' hoochies with a passion, been a long day\nBut I've been driven by attraction in a strong way\nYour body is bangin' baby, I love it when you flaunt it\nTime to give it to daddy, nigga, now tell me how you want it\n\n[Chorus: K-Ci & JoJo]\nHow do you want it?\nHow does it feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real\nHow do you want it, yeah?\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real (C'mon!)\n\n[Verse 2: 2Pac]\nTell me is it cool to fuck?\nDid you think I come to talk? Am I a fool or what?\nPositions on the floor, it's like erotic\nIronic, 'cause I'm somewhat psychotic\nI'm hittin' switches on bitches\nLike I been fixed with hydraulics\nUp and down like a roller coaster\nI'm up inside ya, I ain't quittin' 'til the show is over\n'Cause I'm a rider, in and out just like a robbery\nI'll probably be a freak and let you get on top of me\nGet her rockin' these, nights full of Alizé\nA livin' legend you ain't heard about\nThese niggas run these Cali days\nC. Delores Tucker, you's a motherfucker\nInstead of tryin' to help a nigga, you destroy a brother\nWorse than the others, Bill Clinton, Mister Bob Dole\nYou're too old to understand the way the game's told\nYou're lame so I gotta hit you with the-\nOnce I'm released, I'm makin' millions, nigga, top that\nThey wanna censor me; they'd rather see me in a cell\nLivin' in hell, only a few of us'll live to tell\nNow everybody talkin' about us, I could give a fuck\nI'd be the first one to bomb and cuss\n\n[Chorus: K-Ci & JoJo]\nHow do you want it?\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real (Say, c'mon!)\nHow do you want it?\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real\n\n[Verse 3: 2Pac]\nRaised as a youth, tell the truth\nI got the scoop on how to get a bulletproof\nLickin' shots off from the roof\nBefore I was a teenager, mobile phone, Skypager\nGame rules, I'm livin' major\nMy adversaries is lookin' worried\nThey paranoid of gettin' buried\nOne of us gon' see the cemetery\nAnd one day my lifestyle changed, however am I still the same?\nSurviving in this game, am I still the same?\nHoney, just meet me at the strip club, bring a doll\nLook how they take it for that cash, when it's in, it's on\nGot no sympathy for those afraid of mystery\nCome get with me, I'm full of passion and Hennesy\nOn the low, can I come over, I better not\n'Cause you gon' be the one to handcuff me, and get it right\nYour body is bangin', I love the way your colors are\nNow give it to Daddy baby\n\n[Chorus: K-Ci & JoJo]\nHow do you want it?\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real\n\nHow do you want it?\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real\n\nHow do you want it?\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real\n\nHow do you want it?\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real\n\n[Interlude: 2Pac]\nAh yeah, ah yeah, ah yeah, ah yeah\nHow you want it\nHow you want it\nHow you want it\nHow you wan it\n\n[Chorus: K-Ci & JoJo]\nHow do you want it?\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real\nHow do you want it?\nHow do you feel?\nComin' up as a nigga in the cash game\nLivin' in the fast lane, I'm for real\n\n[Outro: 2Pac & (K-Ci & JoJo)]\n(Uh! Ha, ha, ha)\n(Hey yo, peace L.A., for real!)\nThank y'all L.A., one love!\n(Love y'all, for real!)\n(Yeah, yeah, yeah, yeah)", "image": "https://images.genius.com/aceb98afaa438b9a1b348f7296ac142f.594x594x1.jpg"}], "artist": "2Pac"}