{"songs": [{"title": "Black Jesus (OG Original Version)", "album": null, "year": null, "lyrics": "[Intro: 2Pac + (Kadafi) + Val Young]\nSearchin' for Black Jesus\nOh yeah, sportin' jewels and shit, yaknahmean?\n(You can be Christian)\nStraight tatted up\n(Baptist, Jehovah Witness) No doubt\n(Islamic) No doubt (Doesn't matter to me, I'm a thug)\n(Thugs, we praise Black Jesus, all day)\nYoung Kadafi in this bitch, set it off, nigga...\n\nWe believed in you\nFor everything you do\nJust wanna let you know how we feel\nBlack Jesus\n\n[Verse 1: Kadafi]\nI do my shootings on a knob, prayin' to God for my squad\nStuck in a nightmare, hopin' he might care\nThough times is hard, up against all odds, I play my cards\nLike I'm jailin', shots hittin' up my spot like midnight rains hailin'\nGot me bailin' to stash more green guys\nAin't tryin' to be trapped on no block\nSlangin' them rocks like bean pies\nBrainstorm on the beginnin'\nWonder how shit like the Qu'ran and the Bible was written\nWhat is religion?\nGod's words or a curse like crack?\nShai-tan's way of gettin' us back\nOr just another one of my Black Jesus' traps\n\n[Verse 2: Storm]\nWho's got the heart to stand beside me?\nI feel my enemies creepin' up in silence\nDark prayers, scream violence - demons all around me\nCan't even bend my knees just a lost cloud; Black Jesus\nGive me a reason to survive, in this earthly hell\n'Cause I swear, they tryin' to break my well\nI'm on the edge lookin' down at this bottomless pit\nWill it matter if I cease to exist? Black Jesus\n\n[Chorus: 2Pac]\nAll hail, the pressure no endeavor can fail\nSubmissive souls turn to hoes when exposed to jail\nIn times of war we need somebody raw, rally the troops\nLike a saint that we can trust to help to carry us through\nBlack Jesus, hahahaha\nHe's like a saint that we can trust to help to carry us through\nBlack Jesus\n\n[Verse 3: Hussein Fatal]\nStick-ups, rob past niggas with trigger hiccups\nBodybag you punk pickups when these niggas go put they shit up\nNine-and-a-half out of ten, shorty be twistin' they wrists in cuffs\nAnd for hustlin', go ride on the block with cop Glocks bustin'\nThey thinkin' that it's funny to kill for real\nPlus gettin' twenty 20 bills, twenty minutes makin' money still\nPatrollers be rollin' tryna hold us and haunt us\nAll swooped up and on us, 'cause we groupin' up on corners\nMy Black easy Jesus, please somebody feed us\nI'm shootin', startin' a revolution with my kids\nMy cell block, whatever, held rock but never\nToo close to the sword, he got jail dropped forever, Black Jesus\n\n[Verse 4: 2Pac]\nTo this clique I'm dedicated, criminal orientated\nAn Outlaw initiated, blazed and faded\nMade for terror, major league niggas pray together\nBitches in they grave while my real niggas play together\nWe die clutchin' glasses, filled with liquor bomblastic\nCremated, last wish is niggas smoke my ashes\nHigh sigh why die wishin', hopin' for possibilities\nI'll mob on, while they copy me sloppily\nCops patrol projects, hate the people livin' in them\nI was born an inmate, waitin' to escape the prison\nWent to church but don't understand it, they underhanded\nGod gave me these commandments, the world is scandalous\nBlast 'til they holy high; baptize they evil minds\nWise, no longer blinded, watch me shine, trick\nWhich one of y'all wanna feel the degrees?\nBitches freeze facin' Black Jesus\n\n[Chorus: 2Pac]\nAll hail, the pressure no endeavor can fail\nSubmissive souls turn to hoes when exposed to jail\nIn times of war we need somebody raw, rally the troops\nLike a saint that we can trust to help to carry us through\nBlack Jesus\n\n[Verse 5: Kastro]\nSome say, one day\nSome day, some how\nSome way we gon' fail\nEither six ditches or twelve\nJust stick us and leave us in jail\nOh well, I bail, blazed out drunk as hell\nWaitin' to fade, 'cause Black Jesus see\nJust how this world treat His seeds, His young\nBeat us 'til we dumb for fun, why run\nWhen the outcome don’t do me justice in the long run\nSo I say, \"Fuck this whole world, bitch,\" breathless\nTime is tickin', our minds clickin', 'til we blackout\nGoin' all out, overboard route for clout\nAnd Black Jesus come and save our seeds 'cause we need you\nAll play by the same to see us, Black Jesus\n\n[Outro: Val Young]​\nWe believed in you\nFor everything you do\nJust wanna let you know how we feel\nBlack Jesus\nWe believed in you\nFor everything you do\nJust wanna let you know what you mean\nBlack Jesus\nWe believed in you\nFor everything that you do\nJust wanna let you know how we feel\nBlack Jesus", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}