{"songs": [{"title": "Doggfather (Live 1996)", "album": "Live At The House Of Blues", "year": "2006-10-03", "lyrics": "[Intro: Daz & (Snoop Dogg)]\nHey Snoop\n(What's Up?)\n\n[Verse 1: Snoop Dogg]\nI put down more hits than mafioso made\nAnd Lucky Luciano 'bout to sing soprano\nAnd I know, I know the way you feel\nAnd baby bubba we gon' keep it on tha real\nJust to get you caught up in amazement\nWe puffin' on Cubans so it might get dangerous\nBut when it isn't, you can sit izzon bizzack\nAnd let the Bizzow Wizzow ride the trizzack, ha ha\nHow you feelin'? I'm up to dealin', ridin' like a villain\nMakin' a killin', thrillin' the crowd wit my new hairdo\nOutfits unused, fifty dollar socks, hundred-thousand dollar shoes\nMan, I'm givin' blues to these sucka MC's\nWho you be? You know who I be, young nigga\nI'm Tha DoggFather\n\n\n[Chorus]\nYeah, yeah, c'mon\nUh c'mon\nUh c'mon\nUh c'mon\nSnoop Doggy Dogg is Doggy Dogg Father (Father)\nUh c'mon\nUh c'mon\nUh c'mon\n\n[Verse 2: Snoop Dogg]\nLet's make a move for this paper (Where we rollin' Dogg?)\nWe got's ta get paid (Makin' money all ya'll)\nI mean I steps to tha stage in my G-boy stance\nAnd say a few rhymes to make your girl wanna dance\nI'm so fly like a dove\nI come from up above\nYou trippin' on your girl cause she showed me love\nNigga don't beat em, cause if you beat 'em, you don't need 'em\nYou lay your hands on me, watch how fast I take your freedom\nI delete em, but don't mistreat 'em\nI stay up on em, and that's one ta grow on\nLet me flow on\nYou can rock to the rhythm you see\nOr you can rock to the rhythm of me\nJust remember when you do your thang\nMake sure you do your thang on a hang\nAnd everything, is everything\nThere ain't no mo' than this paper chase\nLike them white boy DA's was on the case\nYou know I ain't tryna floss, but uh\nMurder was the, murder was the case that they lost\nI'm Tha DoggFather\n\n[Bridge]\nC'mon, yeah, c'mon, c'mon\nSomebody say \"hell yeah\"\nHell yeah\nSay \"hell yeah\"\nHell yeah\nDo anybody in the house remember?\nC'mon, c'mon, yeah, c'mon\nC'mon\nC'mon\nC'mon\nC'mon\n\n[Verse 3: Snoop Dogg]\nNow, do anybody in the house remember\nWhen there wasn't no Snoop Dogg? (Hell yeah!)\nThere wasn't no rappers hollerin' 'bout LBC\nAm I trippin' ya'll? (Hell nah!)\nNow, when I grow up, I wanna be like Snoop\nHave prestigious women\nThat's the truth from the beginning\nIn and out of the flyest hotels\nYou say your family don't know me\nHold on homie, that's for most and promos\nSales, tails, scales and jails\nSuccess before death\nNo one in my clique fails\nAs females with the almighty Father lead\nSucceedin' ta give my peep's just what they need\nAnd it ain't no party like this kind\nCause you can leave your worries behizzind\nBut I'mma git back to the grizzind\nSnoop D-O double G comin' back for mizzine and\nI'm tha DoggFather\n\n[Outro]\nSnoop Doggy Dogg is Doggy...", "image": "https://images.genius.com/aceb98afaa438b9a1b348f7296ac142f.594x594x1.jpg"}], "artist": "2Pac"}