{"songs": [{"title": "Out On Bail (OG Original Version)", "album": "Out On Bail (Demo)", "year": null, "lyrics": "[Intro]\nOh, I posted bail? I'm out this motherfucker? I could go?!\nAw, fuck y'all! Ay, fuck the judge!\nFuck the motherfuckin' district attorney, the prosecutor\nAnd fuck you motherfuckers in the jury box, fuck all y'all!\n'Cause I'm out on motherfuckin' bail\nY'all ain't never gon' see me in this motherfucker again!\nDrop that shit LG\nLet these ol' punk-ass bitches know how we runnin' this shit for the 9-4\nNiggas ain't goin' back to court, you stank ass bitches\n\n[Verse 1]\nI'm stuck in jail, the D.A.'s tryin' to burn me\nI'd be out on bail, if I had a good attorney\nWant to label me a criminal and cuff me up\nGot a pocket full of money so they rough me up - I ain't trippin'\nIn the county and I'm mad as fuck\nGot a record so they put me with the baddest bunch\nEverybody wanna talk 'cause I'm rappin', they askin' me what happened\nIs it true you did a flick with Janet Jackson?\nI can't sleep, they takin' Polaroids\nAnd I'm tryin' to use the phone, but they makin' noise\nMan, I wish I had my Glock, 'cause it's major\nI'm makin' shanks out the plastic in razors\nThese motherfuckers won't leave me alone, that's my word\n'Bout to turn a violation to a motherfuckin' murder\nI'm makin' collect calls to my ol' bitches\nSend mo' pictures, and make me some mo' riches\nTo all the suckers on the block, talkin' shit while I was locked up\nBe prepared to get socked up\n'Cause the game is deep, and the fame is brief\nAnd you bullshittin' bitches ain't changin' me\nI came straight up out the gutter, I was saved from hell\nAnd I'm a thug, I was raised in jail, now I'm out on bail\n\n[Chorus]\n(Out on bail) You know what fuckin' time it is\n(Thug life will never fail) I'm out on bail\n(Thug life nigga) I'nn going straight to the motherfuckers who BEYOTCH!\nI'm out on bail (Out on bail)\nHand me some motherfuckin' cold 40's in this bitch, nigga\n(Thug life will never fail) 'Cause I'm out on bail\n(Thug life nigga) Ay pass me my motherfuckin' Rolex\n(Thug life nigga) Yes bitch, that's a Presidential\n\n[Verse 2]\nI'm stuck in jail, and mad as a bitch\nI'd be out on bail, if it wasn't for the snitch\nRunnin' wild through the streets like I'm loco\nAnd fuck the punk police and they chokeholds\nI got no love in my heart 'cause I'm heartless\nMobbin' in the park after dark when I start shit\nRippin' up the scene as a teen I was at it, hey\nAnd sellin' products to the addicts 'cause they gotta have it\nI was a well-known thug and I got a lot of love\nHangin' out with the O.G.'s, shootin' up the club\nAnd momma told me, don't hang with the homies\nBut they got me if they need me, then it's on, G\nGot me sittin' in a cell, a five-by-seven\nWill I finally get to go to ghetto heaven?\nGot my bitches on the outside, writin' me letters\nAnd they tell me they love me, and the shit'll get better\nI don't believe 'em 'cause I just got the news on the wire\nTake it how you want it but your picture's on fire\nI gotta be a player so I stay strong\n'Cause I know that I won't be away long\nAnd when I finally do hit the fuckin' streets, I'ma handle this\nA thug nigga gettin' scandalous, I'm on bail\n\n[Chorus]\n(Out on bail, thug life will never fail) I'm out on bail\n(Thug life nigga, thug life nigga) I'm out on bail\n(Out on bail, thug life will never fail) I'm out on bail\n(Thug life nigga, thug life nigga)\n\n[Outro]\nGet me up out this shit\nYo, LG, get up out this motherfucker, man\nThese motherfuckers tryna harass a player\nMan, I ain't goin' for this ol' crazy ol' shit\nDealin' with you scandalous bitches\nY'all need to lock up some of these crooked ass motherfuckin' police\nBut until you do, here go the motherfuckin' fetti, I'm out on bail\nI'll see you motherfuckers at the next show\nBy the way, where is my bitch?\nYou know, that's that ol' real thug shit\nReal live thug shit, genuine, y'knahmsayin?\nI wouldn't waste yo' motherfuckin' time with no bullshit, baby\nTrust me, it's that real shit\nI'm talkin' 'bout that shit you can be tellin' your grandkids about, y'know?\nI ran with a thug nigga, believe that\nThis my motherfuckin' nigga LG on the motherfuckin' boards, in case you're wonderin'\nWe doin' this shit, hell motherfuckin' yeah\nAn ounce of that shit, sittin' in yo' motherfuckin' lap\nNow press rewind, nigga", "image": "https://images.genius.com/dab42b5340d0b7bc41d25e058e639e2a.479x479x1.jpg"}], "artist": "2Pac"}