{"songs": [{"title": "Tha Shiznit (Live 1996)", "album": "Live At The House Of Blues", "year": "1996-07-04", "lyrics": "[Intro]\nMake some motherfucking noise!\nYeah\nC'mon, yeah, yeah, yeah, yeah, yeah\nC'mon, yeah, yeah, yeah\n\nThe D.O. double G\nThe P.O.U.N.D\nThe D.O. double G\nThe P.O.U.N.D\n\n[Verse 1: Snoop Dogg]\nPoppin', stoppin', hoppin' like a rabbit\nWhen I take the Nina Ross, ya know I gots to have it\nI lay back in the cut, retain myself\nThink about the shit, and I'm thinkin' wealth\nHow can I makes my grip\nAnd how should I make that nigga straight slip\nSet trip, gotta get him for his grip\nAs I dip around the corner, now I'm on another\nMission, wishin', upon a star\nSnoop Doggy Dogg with the caviar\nIn the back of the limo, no demo, this is the real\nBreakin' niggas down like Evander Holyfield, chill\n'Til the next episode\nI make money, and I really don't love hoes\nTell you the truth, I swoop in the Coupe\nI used to sell loot, I used to shoot hoops\nBut now I make hits every single day\nWith that nigga, the diggy Dr. Dre\nSo lay back in the cut motherfucker 'fore you get shot\nIt's 1-8-7, and you know it don't stop\n\n[Chorus: Tha Dogg Pound & (Audience)]\nNow when I say hell, you say yeah\nHell (Yeah!)\nWhen I say hell, you say yeah\nHell (Yeah!)\n\n[Verse 2: Snoop Dogg]\nBoy it's gettin' hot, yes indeed it is\nSnoop Dogg is on the mic, I'm 'bout as crazy as Biz\nMarkie, spark the chronic bud real quick\nAnd let me get into some fly gangsta shit\nYeah, I lay back, stay back in the cut\nNiggas try to play the D-O-G like a mutt\nI got a little message, don't try to see Snoop\nI'm finna fuck a bitch, what's her name? It's Luke\nYou tried to see me on the TV, you'se a B.G\nD-O-double-G, yes I'm a O.G\nYou can't see my homie Dr. Dre\nSo what the fuck a nigga like you gotta say\nGotta take a trip to the MIA\nAnd serve your ass with a motherfuckin' AK\nYou can't see the D-O-double-G, 'cause that be me\nI'm servin' 'em, swervin' in the Coupe\nThe Lexus flexes from Long Beach to Texas\nSexist hoes, they wanna get with this\n'Cause Snoop Dogg is the shit, biatch!\n\n[Audience Applause]", "image": "https://images.genius.com/aceb98afaa438b9a1b348f7296ac142f.594x594x1.jpg"}], "artist": "2Pac"}