{"songs": [{"title": "Who Am I? (What’s My Name?) (Live 1996)", "album": "Live At The House Of Blues", "year": "2005-10-03", "lyrics": "[Spoken Word Intro]\nC'mon, c'mon (Ha ha)\nYeah, c'mon\nC'mon, c'mon, bounce\nC'mon, c'mon, bounce\nC'mon, bounce\n\n[Chorus: Snoop Dogg & (Audience)]\nWhat's my motherfuckin' name?\n(Snoop Doggy Dogg)\nWhat's my motherfuckin' name?\n(Snoop Doggy Dogg)\n\n[Verse 1]\nFrom the depths of the sea, back to the block\nSnoop Doggy Dogg, funky as the, the, The D.O.C\nWent solo on that ass, but it's still the same\nLong Beach is the spot where I serve my 'caine\nFollow me, follow me, follow me, follow me, but don't lose your grip\nNine-trizzay's the yizzear for me to fuck up shit\nSo I ain't holdin nuttin' back\nAnd motherfucker, I got five on that twenty sack\nIt's like that and as a matter of fact (Rat-tat-tat-tat)\n'Cause I never hesitate to put a nigga on his back\nYeah, so peep out the manuscript\nYou see that it's a must we drop gangsta shit\n\n[Chorus: Snoop Dogg & (Audience)]\nWhat's my name?\n(Snoop Doggy Dogg)\nWhat's my motherfuckin' name?\n(Snoop Doggy Dogg)\nNow let me hear you say \"Ola, ola, ola\"\n(Ola, ola ola)\nLet me hear you say \"ola, ola, ola\"\n(Ola, ola ola)\n\n[Verse 2]\nIt's the bow to the wow, creepin and crawlin\nYiggy yes y'allin, Snoop Doggy Dogg in\nThe motherfuckin house like everyday\nDroppin shit with my nigga Mr Dr. Dre\nLike I said, niggas can't FUCK with this\nAnd niggas can't FUCK with that\nShit that I drop 'cause ya know it don't stop\nMr. One Eight Seven on a motherfuckin cop\nTick tock, never the Glock, just some nuts and a cock\nRobbin motherfuckers then I kill dem bloodclots\nThen I step through the fog and I creep through the smog\n'Cause I'm Snoop Doggy (who?) Doggy (what?) Doggy\n\n[Chorus: Snoop Dogg & (Audience)]\nWhat's my motherfuckin' name?\n(Snoop Doggy Dogg)\nI can't hear y'all, what's my motherfuckin' name?\n(Snoop Doggy Dogg)\nNow let me hear you say \"hell yeah\"\n(Hell yeah)\nSay \"hell yeah\"\n(Hell yeah)\nNow somebody, anybody, everybody scream\n\n[Verse 3]\nNow just throw your hands in the motherfuckin air\nAnd wave the motherfuckers like ya just don't care\nYeah roll up the dank, and pour the drank\nAnd watch your step (Why?) 'cause Doggy's on the gank\nMy bank roll's on swoll\nMy shit's on hit, legit, now I'm on parole, stroll\nWith the Dogg Pound right behind me\nAnd up in yo bitch, is where ya might find me\nLayin' that, playin' that G Thang\nShe want the nigga with the biggest nuts, and guess what?\nHe is I, and I am him, slim with the tilted brim\n\n[Chorus: Snoop Dogg & (Audience)]\nWhat's my motherfuckin' name, y'all?\n(Snoop Doggy Dogg)\nC'mon, make some motherfuckin' noise, what's my motherfuckin' name?\n(Snoop Doggy Dogg)\nLadies, what's my motherfuckin' name?\n(Snoop Doggy Dogg)\nHouse of Blues, what's my motherfuckin' name?\n(Snoop Doggy Dogg)\n\n[Outro]\nYou know", "image": "https://images.genius.com/aceb98afaa438b9a1b348f7296ac142f.594x594x1.jpg"}], "artist": "2Pac"}