{"songs": [{"title": "Thugs Wrath", "album": "Picture My Pain", "year": null, "lyrics": "[2Pac talking]\nTake a ride to my block (my block)..\nThat's right.. Rest in peace to all the motherfuckers that past away\nMakaveli in this.. Thats how you do that shit..\n\n[Verse 1]\nThey got a nigga\nShedding tears, reminiscing on my past fears\nCause shit was hectic for me last year\nIt appears that I've been marked for death, my heartless breath\nThe underlying cause of my arrest, my life is stressed\nAnd no rest forever weary, my eyes stay teary\nFor all the brothers that are buried in the cemetery\nShit is scary, how black on black crime legendary\nBut at times unnecessary, I'm getting worried\nTeardrops and closed caskets, the three strikes law is drastic\nAnd certain death for us ghetto bastards\nWhat can we do when we're arrested, but open fire\nLife in the pen ain't for me, cause I'd rather die\nBut don't cry through your despair\nI wonder if the Lord still cares, for us niggas on welfare\nAnd who cares if we survive\nThe only time they notice a nigga is when he's clutching on a 4.5\n\n[Chorus x2]\nThey tell us that we hopeless and hell bound\nThis for the brothers in penetentiaries jailed down\nHomies in every city definition of power\nIts a thugs wrath. Can you feel me now?\n\n[Verse 2]\nNow shit's constantly hot, on my block, it never fails to be gunshots\nCan't explain a mother's pain, when her son drops\nBlack males living Hell when will we prevail\nFearing jail but crack sales got me living well\nAnd the system's suicidal with this Thug's Life\nStaying strapped forever trapped in this drug life\nGod help me, cause I'm starving, can't get a job\nSo I resort to violent robberies, my life is hard\nCan't sleep cause all the dirt make my heart hurt\nPut in work and shed tears for my dead peers\nMislead from childhood where I went astray\nTill this day I still pray for a better way\nCan't help but feel hopeless and heartbroke\nFrom the start I felt the racism cause I'm dark\nCouldn't quit the bullshit make me represent\nHit the bar and played the star, everywhere I went\n\n[Chorus x2]\nThey tell us that we hopeless and hell bound\nThis fo the brothers in penetentiaries jailed down\nHomies in every city definition of power\nIts a thugs wrath. Can you feel me now?\n\n[Verse 3]\nAnd I can't help but wonder why, so many young kids had to die\nCaught strays from AK's and the driveby\nSwollen pride and homicide, don't coincide\nBrothers cry for broken lives, mama come inside\nCause our block is filled with danger\nUsed to be a close knit community but now we're all cold strangers\nTime changes us to stone them crack pipes\nAll up and down the block exterminating black life\nBut I can't blame the dealers\nMy mama's welfare check has brought the next man chrome wheels\nShit's real, I know ya feel, my tragedy\nA single mother with a problem child, daddy free\nHanging out picking up game, sipping cheap liquor\nGamin the hoochies hoping I can get to sleep with her\nIt's a man's world, staying strapped\nFantasies of a nigga living phat, but held back\n\n[Chorus x2]\nThey tell us that we hopeless and hell bound\nThis fo the brothers in penetentiaries jailed down\nHomies in every city definition of power\nIts a thugs wrath. Can you feel me now?", "image": "https://images.genius.com/fc0e6befb957fcdfa49f5bb3915e344c.500x500x1.jpg"}], "artist": "2Pac"}