{"songs": [{"title": "Live Medley", "album": "2Pac Live", "year": "2014-08-10", "lyrics": "[Part I: California Love]\n\n[Audience Applause]\n\n[Verse: 2Pac]\nOut on bail, fresh out of jail, California dreamin'\nSoon as I step on the scene, I'm hearin' hoochies screamin'\nFiendin' for money and alcohol, the life of a Westside player\nWhere cowards die and the strong ball\nOnly in Cali where we riot, not rally, to live and die\nIn L.A. we wearin' Chucks, not Ballys\nDressed in Locs and Khaki suits, and ride is what we do\nFlossin' but have caution: we collide with other crews\nFamous because we program\nWorldwide, let them recognize from Long Beach to Rosecrans\nBumpin' and grindin' like a slow jam\nIt's Westside, so you know the Row won't bow down to no man\nSay what you say, but give me that bomb beat from Dre\nLet me serenade the streets of L.A\nFrom Oakland to Sac-town, the Bay Area and back down\nCali is where they put their mack down, give me love!\n\n[Chorus: 2Pac]\nCalifornia knows how to party\nCalifornia knows how to party\nKeep it rocking\nKeep it rocking\n\n[Spoken Word: 2Pac]\nCalifornia Love\nDeath Row\nLet's take 'em to church\n\n[Part II: So Many Tears]\n\n[Spoken Word: 2Pac]\nMy homeboy\nThis goes out to my homeboy [?]\nIf there ain't no justice for the dawg\nAin't no justice whatsoever\n\n[Verse 1]\nBack in elementary, I thrived on misery\nLeft me alone, I grew up amongst a dyin' breed\nInside my mind couldn't find a place to rest\nUntil I got that Thug Life tatted on my chest\nTell me, can you feel me? I'm not livin' in the past\nYou wanna last? See the first to blast\nRemember Kato, no longer with us, he's deceased\nCall on the sirens, seen him murdered in the streets\nNow he rest in peace\nIs there a heaven for a G? Remember me\nSo many homies in the cemetery, shed so many tears\n\n[Refrain]\nLord, I suffered through the years\nAnd shed so many tears\nLord\n\n[Verse 2]\nNow that I'm strugglin' in this business, by any means\nLabel me greedy gettin' green, but seldom seen\nAnd fuck the world 'cause I'm cursed\nI'm havin' visions of leavin' here in a hearse\nGod, can you feel me?\nTake me away from all the pressure and all the pain\nShow me some happiness again\nI'm goin' blind, I spend my time in this cell, ain't livin' well\nI know my destiny is Hell, where did I fail?\nMy life is in denial and when I die\nBaptized in eternal fire, shed so many tears\n\n[Refrain]\nLord, I suffered through the years (C'mon wit' it)\nAnd shed so many tears\nLord, I suffered through the years\nAnd shed so many tears\nLord, I suffered through the years\nAnd shed so many tears\n\n[Audience Applause]", "image": "https://images.genius.com/19ab47132d55172513fea74b3b39e251.394x394x1.jpg"}], "artist": "2Pac"}