{"songs": [{"title": "Murder Was The Case (Live 1996)", "album": "Live At The House Of Blues", "year": "2005-10-03", "lyrics": "[Spoken Intro]\nHey blacken this motherfucker out\nDeath Row\nTurn all these lights out\nTurn all these lights the fuck off\n\nYeah!\nWhat up!\n\n[Verse 1]\nAs I look up at the sky\nMy mind starts tripping, a tear drops my eye\nMy body temperature falls\nI'm shaking and they break in trying to save the Dogg\nPumping on my chest and I'm screaming\nI stop breathing, damn I see demons\nDear God, I wonder can you save me\n(I can't die my boo boo's bout to have my baby)\nI think it's too late for praying, hold up\nA voice spoke to me and it slowly started saying\n(Bring your lifestyle to me, I'll make it better)\nBut how long will I live? (Eternal life and forever)\nAnd will I be the G that I was?\n(I'll make your life better than you can imagine or even dreamed of\nSo relax your soul, let me take control\nClose your eyes my son)\nC'mon, c'mon, c'mon!\nSing that shit!\n\n[Chorus]\nMurder was the case\nMurder was the case\nMurder was the case (C'mon)\nMurder, murder, murder was the case\nMurder was the case (C'mon)\nMurder was the case (C'mon)\nMurder was the case (C'mon)\nMurder, murder, murder was the case\nMurder was the case\nMurder was the case\nMurder was the case\nMurder was the case\nMurder was the case\nMurder was the case\nMurder was the case\nMurder was the case\n\n[Verse 2]\nI'm fresh up out my coma\nI got my Momma and my Daddy and Tha Doggpound in my corner\nIt's gonna take a miracle they say\nFor me to walk again and talk again but anyway\nI get fronted some keys to get back on my feet\nAnd everything that nigga said came to reality\nI'm living like a baller loc\nHaving money and blowing hella chronic smoke\nI bought my Momma a Benz (And bought my boo boo a Jag)\nAnd now I'm rolling in a nine-trizzay El Do-Rag\n(Just remember who changed your mind\nCause when you start set-tripping, that ass is mine, nigga)\nIndeed, agreed proceed to smoke weed\nNever have a want, never have a need\nThey say I'm greedy but I still want mo'\nCuz my eyes wanna journey some mo'\nNew York, check it out\n\n[Bridge]\nNow I lay me down to sleep\nI pray the Lord, my soul to keep\n(Murder was the case)\nIf I should die, before I wake\n(Murder was the case)\nI pray the Lord, my soul to take\n\nNow let me hear you say \"187!\"\n(187!)\nSay \"187!\"\n(187!)\nSay \"187!\"\n(187!)\nSay \"187\"\n(187!)\n\n[Verse 3]\nNo more indo, gin and juice\nI'm on my way to Chino, rolling on the grey goose\nShackled from head to toe\nTwenty-five with an izz-el, with nowhere to gizzo, I know\nThem niggas from the other side recognize my face\nCause it's the O.G. D-O-double-G, L-B-C\nI'm mad dogging niggas cause I don't care\nRed jumpsuit with two braids in my hair\nNiggas stare as I enter the center\nThey send me to a level three yard, that's where I stay\nLate night I hear toothbrushes scraping on the floor\nNiggas getting they shanks, just in case the war, pops off\nCause you can't tell what's next\nMy little homie Baby Boo took a pencil in his neck\nAnd he probably won't make it to see twenty-two\nI put that on Tha pound\nI'ma ride for you Baby Boo\n\n[Outro]\nMurder was the case\nMurder was the case\nMurder was the, murder was the, murder was the case\nSay \"187!\"\n(187!)\nSay \"187!\"\n(187!)\nSay \"187\"\n(187!)", "image": "https://images.genius.com/aceb98afaa438b9a1b348f7296ac142f.594x594x1.jpg"}], "artist": "2Pac"}