{"songs": [{"title": "Ghetto Gospel [Dj One Remix]", "album": null, "year": null, "lyrics": "[ DJ One Remix]\n\n[Verse 1, 2Pac]\n\nIf I could recollect before my hood days\nI'd sit, reminisce thinking a bliss of the good days\nI stop and stare at the younger\nMy heart goes to 'em\nThey tested it was stress that they under\nWe never really went through that\nCause we was born B.C. - you and me before crack\nAnd nowadays things changed\nEveryone's ashamed of the youth cause the truth look - strange\nAnd for me it's reversed\nWe left them a world that's cursed and it - hurts\nCause any day they'll push the button\nAnd all condemned like Malcolm X and Bobby Hutton died for nothing\nDon't it make em get teary\nThe world looks dreary\nBut when you wipe your eyes see it clearly\nThere is no need for you to fear me\nIf you take the time to hear me\nMaybe you can learn to cheer me\nIt ain't about black or white cause we're human\nI hope we'll see the light before it's ruined\nMy Ghetto Gospel\n\n(Chorus, Akon)\nWho ever said that this trouble would stop today\nA lot of niggas get locked away\nTeenage women growing up with AID's\nCause that's the life when your living in the\nGhetto\nOhh eating in the\nGhetto\nOhh sleeping in the\nGhetto\nThat's the life when your living in the\nGhetto\nOhh eating in the\nGhetto\nOhh sleeping in the\nGhetto\n\n[Verse 2, 2Pac]\n\nTell me do you see that old lady ain't it sad\nLiving out of bags but she's glad for the little things she has\nAnd over there there's a lady, crack got her crazy, well guess who's giving birth to a baby\nI don't trip to let her fade me\nFrom outta the frying pan we jump into another form of slavery\nAnd even now I get discouraged\nI wonder if they take it all back will I still keep the courage?\nI refuse to be a role model\nI say ghost take control drink out my own bottles\nI make mistakes but learn from everyone\nAnd when it's said and done\nI bet this brother will be a better one\nIf I upset you, don't stress, never forget that God isn't finished with me yet\nI feel his hand on my brains when I write rhymes I go blind and let the Lord do his thing\nBut am I less holy?\nCause I choose to puff a blunt, and drink a beer with my homies\nBefore we find world peace\nWe gotta find peace there's a war in the streets\nMy Ghetto Gospel\n\n(Chorus, Akon)\nWho ever said that this trouble would stop today\nA lot of niggas get locked away\nTeenage women growing up with AID's\nCause that's the life when your living in the\nGhetto\nOhh eating in the\nGhetto\nOhh sleeping in the\nGhetto\nThat's the life when your living in the\nGhetto\nOhh eating in the\nGhetto\nOhh sleeping in the\nGhetto\nGun shot every night in the\nGhetto\nCrooked cops on side in the\nGhetto\nEveryday is fight in the\nGhetto\nOh oh oh oh oh\nGhetto\nGot kids to feed in the\nGhetto\nSellin coke and weed in the\nGhetto\nEveryday somebody bleed in the\nGhetto\nOh oh oh oh oh\nGhetto", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}