{"songs": [{"title": "2Pac’s “Hold Ya Head”", "album": "Desire/Faith/Persistence", "year": null, "lyrics": "[Intro]\n[Prison in the background while 2Pac speaks]\nYo, Jackson! (A 231549)\nYeah, close four! Comin' down!\nCrichlow! (A 5991301)\nClose five! Comin' down!\n\n[2Pac]\nMy homeboys in Clinton and Rikers Island\nAll the penitentiaries\nMumia, Mutulu, Geronimo, Sekon\nAll the political prisoners\nSan Quentin (who can save you).. all the jailhouses\nI'm with you\n\nYeah\nOne thug, one thug (How do we keep the music playing)\nYou're listenin to the sounds of one, thuuug\nOne thug, one thug (How do we get ahead)\nYou're listenin to the sounds of..\n\n[Verse 1: 2Pac]\nI wake up early in the mornin, mindstate so military\nSuckers fantasizin pictures of a young brother buried\nWas it me, the weed, or this life I lead\nIf daytime is for suckers then tonight we breathe\nOut for all that, knowin that this world bring drawbacks\nLook how they shiver once I deliver these raw raps\nMeet me at the cemetery dressed in black\nTonight we, honor the dead, those who won't be back\nSo if I die, do the same for me, shed no tears\nAn Outlaw, thug livin in this game for years\nWhy worry, hope to God, get me high when I'm buried\nKnowin deep inside only a few love me\nCome rush me to the gates of heaven, let me picture for a while\nHow I lived for my days as a child; I wonder now\nHow do we outlast, always get cash\nStay strong if we all mash, hold ya head\n\n[Hook: Tyrone Wrice + 2Pac]\nHow do we keep the music playing (yes, you got to hold ya head)\nHow do we get ahead.. (hold your head!)\nToo many young black brothers are dying (yes, you got to hold ya head)\nLivin fast, too fast..\n\n[Verse 2: 2Pac]\nHahaha, yo\nThese felonies be like prophecies beggin me to stop\nCause these lawyers gettin money everytime they knock us\nSnatchin pockets lyrically, suckers flea when they notice\nSwitched my name to Makaveli, half the rap game ghost\nExposed foes with my hocus pocus flows they froze\nNow suckers idolize my, chosen blows\nAnd mo' money mean litigatin, mo' playa hatin\nGot a cell at the pen for me waitin – is this my fate?\nMiss me with that misdemeanor thinkin, me fall back?\nNever that, too much tequila drinkin, we all that\nMake them understand me? hell nah, this ain't my posse\nEveryone with me is family, cause everybody's got me\nWatch me paint a perfect vision, this life we livin\nGot us all meetin up in prison..\nLast week I got a letter from my road dog, written in blood\nSaying, \"Please show a playa love\" - hold ya head!\nHold it\n\n[Hook]\n\n[Verse 3: 2Pac]\nThe weed got me tweakin in my mind, I'm thinkin..\nGod bless the child that can hold his own\nIndeed, enemies bleed when I hold my chrome\nLet these words be the last to my unborn seeds\nHope to raise my young nation in this world of greed\nCurrency means nothin if you still ain't free\nMoney breeds jealousy, take the game from me\nI hope for better days, trouble comes naturally\nRunning from authorities 'til they capture me\nAnd my, aim is to spread mo' smiles than tears\nUtilalize lessons learned from my childhood years\nMaybe Mama had it all right, rest yo' head\nStraight converstions all night, bless the dead\nTo the homies that I used to have that no longer roll\nCatch a brother at the crossroads..\nPlus nobody knows my soul, watchin time pass\nThrough the glass of my drop-top Rolls, hold ya head!\n\n[Hook]\n\n[Outro (over hook)]\nNo matter how hard it get, feel me\nGet the weed, drink a drink, read a book\nWatch the stars, get some pussy, whatever..\n\n[Hook repeats to fade]", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}