{"songs": [{"title": "Some Bomb Azz (Pussy) (Live 1996)", "album": "Live At The House Of Blues", "year": "2018-10-03", "lyrics": "[Spoken Intro: Snoop Dogg]\nNow this one's for the ladies\nFor the ladies\nL.T., bring the ladies to the front\nYo I dedicate this song to baby right there\nBaby right there\nWhat's up girl?\nC'mon, got the bomb\nC'mon, c'mon, c'mon, c'mon\nC'mon, c'mon, c'mon, yeah\nC'mon, c'mon, c'mon\n\n[Chorus]\nLet me say she got the bomb ass pussy\nYeah, she got the bomb ass pussy\nOoh, she's gots the bomb\nOoh, bet she's got a bomb ass pussy\nSay ooh, she got the bomb\nOoh, baby got the bomb ass pussy\nOoh, she got the bomb\nCheck it out\nBaby, you got the bomb ass pussy\n\n[Refrain]\nHave you ever, have you ever had some bomb pussy\nHave you ever, have you ever had some bomb pussy\nHave you ever, have you ever had some bomb pussy\nHave you ever, have you ever\n\n[Snoop Dogg]\nI took a trip to the other side of the planet\nFuckin hoes in Japan didn't understand it\nJoe Cool is my witness and the homey style\nBlowin Saki part one, gettin buckwild\nWith some hoes from the other side of the globe\nI mean this bitch pussy so tight it's fittin like a glove\nCould it be a small case of puppy love you see?\n\"Snoop Doggy I love you,\" hey look you ain't in love with me\n\n[Kurupt]\nNow if I fucked yo' bitch, would a nigga trip?\nDid you know your ho's goin' round blowin' niggas dicks?\nNow would you trip? Now trip I can, I go back\nTo when me and Daz was chillin/ in Atlanta\nAtlanta was the place to be, see it was bitches and shit\nWe had a, show to go do down at the FreakNik, we had a\nBitch, that was all up on our dicks\nCause she knew about the homey and she knew about the Click\nI'm Kurupt, and that's the homie Daz\nSo what's crackin' with the H, she got the bomb ass pussy\n\n[Chorus]\nShe got the bomb\nC'mon everybody, I heard she got some bomb ass pussy\nEverybody, she got the bomb, the bomb, the bomb\nI heard she got some bomb ass pussy\nEverybody, she got the bomb, the bomb, the bomb\nI heard she got some bomb ass pussy\nOoh, she's gots the bomb\nDamn, I heard she got some bomb ass pussy\n\n[Korupt]\nHey Daz\n\n[Daz]\nWhat's up?\n\n[Korupt]\nI be trippin' over the pussy\nAnd the pussy be like damn, damn, damn, damn\n\n[All]\nOh! Whoo!\n\n[Korupt]\nAnd the pussy be looking so good or ugly\nBut if it's all good\nOh shit\n\n[Daz]\nNow tell the ho this is what's happening\nBut still show her some stacks and in fact\nShe'll lick me down slow\nYa know, That's what  I want, that's what I need\nNow don't it satisfy her to fulfill my needs\nThe ho get to suckin'\nFive minutes, get the fuck, what\nNow the ho shocked, the nigga slipped off the rubber\nI said \"Oh no,\" I bust a hellified superfied nut\nI had to go stay pimpin' in the city, ass and tities\nSome bitches have the bomb pussy, but some bitches didn't have\n\n[Outro]\nHave you ever had some bomb ass pussy?\nTo make you want to scream, kapow\nDTG", "image": "https://images.genius.com/aceb98afaa438b9a1b348f7296ac142f.594x594x1.jpg"}], "artist": "2Pac"}