{"songs": [{"title": "Pain (Nu-Mixx)", "album": "Nu Mixx Klazzics Vol. 2 (Mixtape)", "year": "2007-08-14", "lyrics": "[Intro: 2Pac & (Styles P)]\nUh, pain, pain...\n(So much pain, so much pain)\n\n[Verse 1: 2Pac]\nThey'll never take me alive\nI'm gettin' high with my 4-5\nCocked on these suckas, time to die\nEven as a youngster\nCausin' ruckus on the back of the bus\nI was a fool all through high school, kickin' up dust\nBut now I'm labled as a troublemaker\nWho can you blame?\nSmokin' weed helped me take away the pain\nSo I'm hopeless\nRollin' down the freeway swervin', don't worry\nI'm 'bout to crash up on the curb 'cause my vision's blurry\nMaybe if they tried to understand me\nWhat should I do?\nI had to feed my fuckin' family\nWhat else could I do?\nBut be a thug\nOut slangin' with the homies\nFuck hangin' with them phonies in the club\nGot my mind on danger\nNever been a stranger to homicide\nMy city's full of gangbangers and drive-bys\nWhy do we die at an early age?\nHe was so young, but still a victim of the 12-gauge\nMy memories of a corpse, mind full of sick thoughts\nAnd I ain't goin back to court, so fuck what you thought\nI'm drinkin' Hennessy, runnin' from my enemies\nWill I live to be 23? There's so much pain\n\n[Chorus: Butch Cassidy]\nThug soldier 'til I die\nKeep family by my side\nAll night, I'm getting high\nLife's so full of pain, have you ever seen a thug cry?\nMamas standing on the streets\nGotta get back on my feet\nStressed out, I can't sleep\nLife's so full of pain, have you ever seen a thug cry?\n\n[Verse 2: Styles P]\nI seen a couple niggas shot in the brain\nSeen a couple niggas shot in the frame\nAnd I'm tryna maintain\nTell the truth though, the shit ain't the same\nI'ma die a thug, fuck it, it's the blood in my vein\nWhy complain 'cause we all gon' die, but I could wait\nI'm the letter after F and right before H\nI'm a G nigga, see nigga, the pain in my eye\nPlayer player play the game and you die\nI do a buck-85 and  the beam in the ride\nEven hot from the flame of the 9\nNo stranger to danger in mine\nMatter fact, I be bangin' for mine\nGot a closet full of guns and I'm hangin' with mine\nSo much pain, yeah, I spent years doing sicker shit\nIf I cried, the tears'll probably be blood and liquor mixed\nAnd you ain't seen a nigga on no bicker shit\nLife's a bitch, bet you that all my niggas done twisted it\n\n[Chorus: Butch Cassidy]\nThug soldier 'til I die\nKeep family by my side\nAll night, I'm getting high\nLife's so full of pain, have you ever seen a thug cry?\nMamas standing on the streets\nGotta get back on my feet\nStressed out, I can't sleep\nLife's so full of pain, have you ever seen a thug cry?\n\n[Verse 3: 2Pac]\nThey got me mobbin' like I'm loc'ed\nAnd ready to get my slug on\nI load my clip and slip my motherfuckin' gloves on\nI ain't scared to blast on these suckas if they test me\nTrust, I got my Glock cocked, playa, if they press me\nBust some motherfuckers with a PASSION\nBetter duck 'cause I ain't lookin when I'm BBBBLASTIN'\nI'm a nut and drinkin' Hennessy\nAnd gettin' high, on the lookout for my enemies\nDon't wanna die, tell me why\n'Cause this stress is gettin' major\nA buck-fifty across my face with my razor\nWhat can I do but be a thug until I'm dead and gone?\nI keep my brain on tha game and stay head-strong\nThese sorry bastards want to kill me in my sleep\nI'm real, they cannot see\nAnd every day is just a struggle\nSteady thuggin' on the streets\nAnd I'll be ballin', loc, don't let 'em make you worry\nKeep swingin' at these suckas 'til you buried\nI was born to raise, hell, a nigga from the gutta\nWord to mother, I'm touched\nI'm kickin' dust up, ready to bust\nI'm on the scene steady muggin' mean, until they kill me\nI'll be livin' this life, I know you feel me\nThere's so much pain\n\n[Chorus: Butch Cassidy]\nThug soldier 'til I die\nKeep family by my side\nAll night, I'm getting high\nLife's so full of pain, have you ever seen a thug cry?\nMamas standing on the streets\nGotta get back on my feet\nStressed out, I can't sleep\nLife's so full of pain, have you ever seen a thug cry?\n\n[Outro: 2Pac & (Styles P)]\nSo much pain; there's so much pain\n(So much pain, so much pain)\nThere's so much pain; there's so much pain\n(So much pain, so much pain)\nThere's so much pain", "image": "https://images.genius.com/3df7ac2293876c8e607489cd6238694a.220x220x1.jpg"}], "artist": "2Pac"}