{"songs": [{"title": "Catchin’ Feelins (Original Version)", "album": null, "year": null, "lyrics": "[Intro: 2pac]\n(Hahaha, oh yes)\n(My home boys might squabble but we don’t fall down)\nCatchin feelins\n(Never, hahaha, yeah)\nDid y'all read what Puffy and Big said in Vibe?\n(My home boys might squabble but we don’t fall down)\nDidn't they sound like suckaz?\n(Uh, yeah)\nOutlawz got them on the run\n(My home boys might squabble but we don’t fall down)\nGoing for none\n(Haha, westside, westside)\nOh this part two of the beef\nPart two of the war\n\n[Verse 1: 2Pac]\nCross this nigga here, now Biggie tell me who do you fear?\nAin't a livin' soul breathin' shall pump no fear here\nMy last foe flashed then I mashed his ass\nBastard, fuck with me, bet I blast your ass\nSo many follow but can't reach me, caught in the maze\nCatch them, mimickin' my style tryin' to talk this way\nImpossible my posse droppin' you, we Death Row riders\nNo need to beg, motherfucker, ain't no mercy inside us\nFeelin' blessed, the richer I get, the more I stress\nSmokin' lye watchin' time fly, waitin' for death\nDear God I been feelin' like I'm close to Jesus\nParanoid with my pistols close, smokin' trees\nKeep my eyes on my foes, those close to me\nWatchin' niggas catch strays, shake, choke and bleed\nMe, a mercenary for the streets, check my pedigree\nBustin' motherfuckers it's the thug in me\nNow niggas talk a lotta Bad Boy shit, then get to squealin'\nBitch made catchin' feelins\n\n[Hook: 2Pac]\nOutlaw niggas, are you ready to clown?\nMy homeboys might squabble but we don't fall down\nScreamin' bye bye bitches, untouchable sound\nNiggas hide like hoes when we hit your town\nOutlaw niggas, are you ready to clown?\nMy homeboys might squabble but we don't fall down\nScreamin' bye bye bitches, untouchable sound\nNiggas hide like hoes when we hit your town\nCatchin' feelins", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}