{"songs": [{"title": "Picture Me Rollin’ (Kurupt Remix)", "album": "Nu Mixx Klazzics Vol. 2 (Mixtape)", "year": "2007-07-03", "lyrics": "[Intro: 2Pac]\nPicture me rollin' (rollin', rollin', rollin')\n\nYeah, clear enough for ya? (that right)\n(Hahahahaha) Yeah\n(Hehe) Why niggas look mad (that right)\nY'all supposed to be happy, I'm free!\nY'all niggas look like y'all wanted me to stay in jail, hahah!\nHoe bustaz\n\n[Verse 1: 2Pac]\nPicture me rollin' in my 500 Benz\nI got no love for these niggas, there's no need to be friends\nThey got me under surveillance\nThat's what somebody be tellin'\nKnow there's dope bein' sold, but I ain't the one sellin'\nDon't want to be another number\nI got a fuckin' gang of weed to keep from goin' under\nThe Federales wanna see me dead\nNiggas put prices on my head\nNow I got two Rottweilers by my bed, I feed 'em lead\nNow I'm released, how will I live?\nWill God forgive me for all the dirt a nigga did, to feed kids?\nOne life to live, it's so hard to be positive\nWhen niggas shootin' at your crib\nMama, I'm still thuggin', the world is a war zone\nMy homies is inmates, and most of them dead wrong\nFull grown, finally a man, just schemin' on ways\nTo put some green inside the palms of my empty hands\nJust picture me rollin'\nFlossin' a Benz on rims that isn't stolen\nMy dreams is censored, my hopes are gone\nI'm like a fiend that finally sees when all the dope is gone\nMy nerves is wrecked, heart beatin'\nAnd my hands is swollen\nThinkin' of the G's I'll be holdin', picture me rollin'\n\n[Chorus: Butch Cassidy]\nWhen I'm rollin' you will know it's me\nTrust me, I'm cruising down the block in my Fleet\nRollin' with two bros, down for the dulos\nThis is how us gangstas roll\nPicture me rollin' (Picture me rollin')\nWhen I'm rollin', they be hating on me\nHiding in the cut contemplating on me\nWanting my ride, wanting my dough\nTest and I'll blast fa sho\nForever I'm rollin'\n\n[Verse 2: Kurupt]\nI'm just tired of all the games, people coming in packs\nJust looking for a reason to try to jack\nI got my hand on the squeezer, Young Ebenezer\nI got rashes to spread, Leukemia, Emphysema\nOut the barrel of the .44, I'm on fire like a fever\nI'm a gangsta, my woman is a diva\nA brand new S-Class on the low we dippin' past\nNiggas mad at me, yeah, they hating gladly\nBut all I want you to do is just watch me\nAs I'm rolling by, dippin', getting high\nMe and Soopafly super-duper fly getting super high\nReady for a ride, won't you get inside\nBrand new twisters on the feet with the beat\nJust bumping down the street with nothing but weed\nIt's just a bomb ass day (day), but niggas still upset\nI don't know why, but mama just forgive me\nIf I have to blow this thing out and then send semis up the steps\nI don't want to leave you alone, but see, it's me or him\nAll I'm trying to say is it's either me or him\nMe, I'm trying to do what I do without seeing the pen\nJust rollin' (rollin', rollin')\n\n[Chorus: Butch Cassidy]\nWhen I'm rollin' you will know it's me\nTrust me, I'm cruising down the block in my Fleet\nRollin' with two bros, down for the dulos\nThis is how us gangstas roll\nPicture me rollin' (Picture me rollin')\nWhen I'm rollin', they be hating on me\nHiding in the cut contemplating on me\nWanting my ride, wanting my dough\nTest and I'll blast fa sho\nForever I'm rollin'\n\n[Instrumental break]\n\n[Chorus: Butch Cassidy]\nWhen I'm rollin' you will know it's me\nTrust me, I'm cruising down the block in my Fleet\nRollin' with two bros, down for the dulos\nThis is how us gangstas roll\nPicture me rollin' (Picture me rollin')\nWhen I'm rollin', they be hating on me\nHiding in the cut contemplating on me\nWanting my ride, wanting my dough\nTest and I'll blast fa sho\nForever I'm rollin'", "image": "https://images.genius.com/3df7ac2293876c8e607489cd6238694a.220x220x1.jpg"}], "artist": "2Pac"}