{"songs": [{"title": "Tupac Death 2016 [Explicheat Mix]", "album": null, "year": "2016-09-13", "lyrics": "[2Pac- Hold on Be Strong lyrics mix]\nThere's, never a good day\nCause in my hood they\nLet they AK's pump strays where the kids play\nMy homies dyin' 'fore they get to see they birthdays\nThese is the worst days\nSometimes it hurts to pray\nAnd every Halloween\nCheck out the murder scene\nCan't help but duplicate the violence seen on the screen\nAnd even God turned his back on the ghetto youth\nI know that ain't the truth\nSometimes I look for proof\nI wonder if heaven got a ghetto\nAnd if it does\nDoes it matter if you blood or you cuz\nRemember how it was\nAnd facin me now, what do I do?\nThese thangs that a Thug goes through\nAnd still I rise\nSo keep ya head up\nAnd even though I had\nPain in my heart, I was hopeless from the start\nSo keep ya head up\nAnd make ya mind strong\nIt's a struggle every day...\nHolla if ya hear me!!\n\n[2Pac-Can't C Me Lyrics mix]\nCops and sirens,niggas open fire\nBuncha thug life niggas on the rise\nUntil I die\nAsk me why I'm a Boss Player gettin high\nAnd when I'm rollin by\nNiggas Can't C Me!!\nX2\n\nGive me my money in stacks\nAnd lace my bitches with 9 figures\nReal niggas fingers on nickle plated 9 triggas\nMust see my enemies defeated\nI catch them\nWhile they coughed up and weeded\nOpen fire\nNow them niggas bleedin'\nSee me in flesh\nAnd test\nAnd get your chest blown\nStraight out the west, don't get blown\nMy adversaries cry like ho's\nOpen and shut like doors\nIs you a friend or foe ?\nNigga you ain't know ?\nThey got me stressed out on Death Row\nI've seen money\nBut baby I got to gets mo'\nYou scream and go\n'2Pac'\nAnd I ain't stopping'\nTill I'm well paid\nBails paid\nNow nigga, look what hell made\nVisions of [Dogs] and visualize my debut\nNiggas know me, player\nI gotta stay true\nDon't be a dumb motherfucker\nBecause it's crazy after dark\nWhere the true Thug niggas see ya heart\nNiggas Can't C Me!!\n\n\nCalifornia love.....\n[Dr.Dre-California Love]\nNow let me welcome everybody to the wild, wild west\nA state that's untouchable like Elliot Ness\nThe track hits ya eardrum like a slug to ya chest\nPack a vest for your Jimmy in the city of sex\nWe in that sunshine state where that bomb ass hemp be\nThe state where ya never find a dance floor empty\nAnd pimps be on a mission for them greens\nLean mean money-makin-machines servin fiends\nI been in the game for ten years makin rap tunes\nEver since honeys was wearin sassoon\nNow it's '95 and they clock me and watch me\nDiamonds shinin lookin like I robbed Liberace\nIt's all good, from Diego to tha Bay\nYour city is tha bomb if your city makin pay\nThrow up a finger if ya feel the same way\nDre puttin it down for\nCaliforn-I-a\n\nShake it shake it baby\nShake it shake it baby\nShake it shake it shake it shake it...\nShake it shake it mama\nShake it Cali...\n\n\n[Verse 2: 2Pac]\nOut on bail fresh outta jail, California dreamin\nSoon as I stepped on the scene, I'm hearin hoochies screamin\nFiendin for money and alcohol\nThe life of a west side playa where cowards die and it's all ball\nOnly in Cali where we riot not rally to live and die\nIn L.A. we wearin Chucks not Ballies (that's right)\nDressed in Locs and khaki suits and ride is what we do\nFlossin but have caution we collide with other crews\nFamous cause we program worldwide\nLet'em recognize from Long Beach to Rosecrans\nBumpin and grindin like a slow jam, it's west side\nSo you know the row won't bow down to no man\nSay what you say\nBut give me that bomb beat from Dre\nLet me serenade the streets of L.A\nFrom Oakland to Sacktown\nThe Bay Area and back down\nCali is where they put they mack down\nGive me love!\n\n[Hook of Takin'Over]\nBut you better know try to play 'cause the game is over\nWe takin' over\n\n[2Pac-Takin' Over]\nYou can't break me, never make me busta soft the beats\nThis Outlaw style got a brother off the streets\nMiss Delores Tucker sue me I won't stop\n'Til we get justice for these crooked cops on my block\nTime Warner full of sissies\nTell 'em all to miss me\nA bunch of hypocrites whistling Dixie\nGood riddance cause you never should of touched me\nYou cowards knew you couldn't take the pressure I'ma make you sorry\nTrust me\nDid I cry when they dropped me? (nah), can they stop me? (yeah)\nTryna sell 4 million copies\nIf I wasn't spitting it'd be prison or death\nThis rap game all we got left\nSo try to comprehend where we coming from\nLife as an Outlaw, ain't meant for everyone\nSo here we come\nRecognize how we organize\nStrategize now we unified brothers on the rise\nAnd we don't stop\n\n[Hook]\nThey don't [?] t-t takin' over, we takin' over\nI see you trying on, 'cause we do it better\n[?] what you seek, we'll be coming over\nBut you better know try to play 'cause the game is over\nWe takin' over\n\n[Verse 3: Snoop Dogg]\nI came to get in that ass, Bigg Di-Dogg, push the big hid-ogg\nYou're hoppin' and poppin', how bout you hop up off my bid-alls\nGot dirt on my pid-aws, I broke a few lid-aws\nIt really don't matter cause I'm only here to spit on\nAnd get on and shit on niggas\nDo it to 'em D-O-double, right on nigga\nI'm saggin' it, baggin' it, slangin' dubs\nYou motherfuckas think The Wash is all soap and suds?\nWhat's up cuz?\nIf you tryin' to get a dub sack page me\nThe hoes say \"D-Loc, you so crazy\"\nPoppin' that shit don't faze me\nI need my chips and the dip, it's like gravy\n\n[Verse 4: Dr Dre]\nNow back to the lecture at hand\nPerfection is expected and I'm feelin' that demand\nLos Ang', broad day gunnin'\nThat ain't no earthquake it's just Dre comin'\nIf this shit ain't played, the party ain't bumpin'\nIf I don't show up, the hoes ain't fuckin'\n(Real talk) Cali sunshine, come visit\nJust don't stop at stop signs with bullet holes in it\nAll-Star League, you ridin' benches\nI handles my business, fuck fake niggas\nI sell game a quarter million a track\nSnoop and the Good Doc back with a brand-new sack\nShit's wrong, money gone, I'll blast\nOut of town, out of bounds, no pass\nRunnin' up, talkin' shit, get smashed\n(Shoot first) Ask questions last\n\n[Gangsta's Paradise Hook]\n\n[2Pac-Loyal To The Game]\nNow I've got task on a nigga's ass\nTell me will they blast me\nI think of an alias in case these crooked bitches ask me, now\nIt's gettin crazy after dark\nThese narcs be like trying to shut me down but I'm too smart\nNow picture me scared of the penitentiary\nI've been moving these things since the days of elementary\nNow tell me what ya need when ya see me\nI'm stacking Gs buying all the things on TV, believe me\nI got some killers on my payroll and they know\nWhen it's time to handle business nigga lay low\nAlthough I'm young I'm still coming up\nI'm gettin paid pulling razors on niggas when they running up\nThe first to pull the strap when theres drama\nBuster you ain't heard?\nI been slicing motherfuckers since I lost my mama\nThere ain't a cop that can stop me\nMy posse is cocky and they don't wait until they drop me\nI'm loyal to the game\n\n[Gangsta's Paradise Hook]\n\nNow picture me scared of the penitentiary\nI've been moving these things since the days of elementary\nNow tell me what ya need when ya see me\nI'm stacking Gs buying all the things on TV, believe me\n\n[Lose Power]\nUntil I Die...\n[Five Shots]", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}