{"songs": [{"title": "What’z Ya Phone # (Nu-Mixx)", "album": "Nu Mixx Klazzics Vol. 2 (Mixtape)", "year": "2007-08-14", "lyrics": "[Verse 1: 2Pac]\nWhat'z ya phone number?\nNow, I could make miracles tempos\nIt's instrumental, written for the nymphos\nThat's the intro\nShook when you rushed me\nWalked up and touched me\nWhy? Do you want to fuck me?\nJust 'cause I'm paid in the worst way? True\nLookin' kinda good in your birthday suit\nI wonder if your wild and ya act shy\nDo you like to be on top or the back side?\nWatch when you lick your lips, shake your hips\nGoddamn, I love that shit\nNow let's stop fakin', be real now\nI got a room and a hard on, still down?\nMet ya standin' at a bar full of black dudes\nSaid you wanna see my scars and my tattoos\nWhen we headed for my hideout, act right\nBoss playa when I ride out, that's right\nWhat'z ya phone number?\n\n[Chorus: 2Pac & Casha]\nBaby, it's for sure that we can get it on all night\nBaby, let me give you a call\nHow long will it take to break you off?\n'Til three or maybe four, I'm ready for it all, I'm down\nHey, baby, let me give you a call\nHow long will it take to break you off?\n\n[Verse 2: Vatana Shaw]\nOh shit, you gotta work for the number\nWork a little bit harder for my naked slumber\nTryna get it on the come up\nEase breeze, 1, 2, 3 won't get it from me, no\nCan you think a little farther?\nBaby, throw me them keys and I will push the Gallardo\nAnd I ain't tryna barter\nVice grip on them hips and my lips on your tip, yo\nNow let your face take a taste\nI could promise I'll squirt and it won't be mace\nI'm dumb stuck up in my place\nWhen you leave, it ain't your shoes but my neck you lace\nNow tell me now, can you roll with a boss bitch?\nKeep that thang standing tall for a boss bitch?\nSpit game and keep it clean for a boss bitch?\nGrab a pen and paper said the digits of the boss bitch\n\n[Chorus: 2Pac & Casha]\nBaby, it's for sure that we can get it on all night\nBaby, let me give you a call\nHow long will it take to break you off?\n'Til three or maybe four, I'm ready for it all, I'm down\nHey, baby, let me give you a call\nHow long will it take to break you off?\n\n[Verse 3: 2Pac]\nShit, baby is a dime piece, more than just fine\nShe's personally best from the gods, if I seen her right\nNow, she can get me hard\nDidn't wanna talk to me just to she see my car\nNever had sex with a rich rap star\n'Til I got her in the back of my homeboy's car\nTell me, why do we live this way?\nMoney over bitches, let me hear you say\nWhat'z your phone number? Are you alone?\nGot a pocket full of rubbers, let's bone\nTime for your girlfriend to take you home\nI had fun, but baby, gotta leave me alone\nPicture in my rhyme, take time to rewind\nThese ordinary words I say\nIf you open in your mind, better think and you'll find\nIt's time, let the outlaws play\n\n[Verse 4: Ociris Gomez]\nI know you wanna fuck, let me hear you say\nGive it to you good 'til I cum in your face\nKeep it running like a faucet, who the boss, nigga?\nDon't be scared to toss it, I bet you cum quicker\nI love it how you keep it so thuggish, thuggish\nI feel it through your fingers how you grip this shit\nGot you leaning like a bat, nigga, hit it like a bat\nLike, yeah, mayne, got me high like a plane\nIn the back of a G5, now my legs spread a mile high\nGot you opening my thighs\nWhen your hands on fire, poppin' bottles\nLooking in my shadows, how we get it\nAin't no stoppin' how we did it\nI don't know, I just know I gotta get some\nSo ruthless, when I fuck, better duck\nWhen you see me with Pac in a truck\nRollin' like an 8-ball, now let me break you off\n\n[Chorus: 2Pac & Casha]\nBaby, it's for sure that we can get it on all night\nBaby, let me give you a call\nHow long will it take to break you off?\n'Til three or maybe four, I'm ready for it all, I'm down\nHey, baby, let me give you a call\nHow long will it take to break you off?\nBaby, it's for sure that we can get it on all night\nBaby, let me give you a call\nHow long will it take to break you off?\n'Til three or maybe four, I'm ready for it all, I'm down\nHey, baby, let me give you a call\nHow long will it take to break you off?", "image": "https://images.genius.com/3df7ac2293876c8e607489cd6238694a.220x220x1.jpg"}], "artist": "2Pac"}