{"songs": [{"title": "When We Ride On Our Enemies (Remix)", "album": "The Passion of Tupac (Mixtape)", "year": null, "lyrics": "[Intro: 2Pac]\nFugees! Fugees and Mobb Deep tryin' to diss now too huh?\nHahaha! Well I ain't prejudiced, I don't give a fuck\nThis is what it sounds like - when we ride on our enemies\nBEYOTCH! When we ride on our enemies\n\n[Verse 1: 2Pac]\nHEYYYY! Got some static for some niggas on the other side of town\nLet my little cousin K roll, he's a rider now\nWhat they want from us motherfuckin' thug niggas?\nUsed to love niggas now I plug niggas, and slug niggas\nAm I wrong? Niggas makin' songs, tryin' to get with us\nMust be gone on stress weed, in the West we trust\nTo the chest I BUST! Then we ride 'til the sun come\nShinin' back to brighten up the sky, HOW many die\nHeard the Fugees was tryin' to do me - look bitch!\nI cut yo' face, this ain't no motherfuckin' movie\nTHEN! We watch the other two die slow\nCastrated entertainin' at my motherfuckin' sideshow\nBAM! Set my plan in mo', time to exterminate my foes\nI can't stand you hoes, uhh\nNow label this my fuckin' trick shot\nMy lyrics runnin' all you cowards out of hip-hop\nWhen we RIDE - on our enemies\n\n[Hook: 2Pac]\nWhen we ride on our enemies\nI bet you motherfuckers die, when we ride, on our enemies\nWhen we ride on our enemies\nBet all you motherfuckers die, when we ride, on our enemies\n\n[Verse 2: Eminem]\nThey think they're crazy, but they ain't crazy, let's face it\nShit, basically they're just playing sick\nThey ain't shit, they ain't saying shit, spray 'em 50\nA to the K, get in the way I'll bring Dre and them with me\nAnd turn this day into fucking mayhem, you staying with me?\nDon't let me lose you, I'm not trying to confuse you\nWhen I let loose with this Uzi and just shoot through your Isuzu\nYou get the message? Am I getting through to you?\nYou know what's coming, you motherfuckers don't even know, do you?\nTake some Big and some 'Pac and you mix 'em up in a pot\nSprinkle a little Big L on top, what the fuck do you got?\nYou got the realest and illest killers tied up in a knot\nThe juggernauts of this rap shit, like it or not\nIt's like a fight to the top just to see who'd die for the spot\nYou put ya life in this, nothing like surviving a shot\nY'all know what time it is, soon as 50 signs on this dot\nShit what you know about death threats, 'cause I get a lot\nShady Records was eighty seconds away from the towers\nSome cowards fucked with the wrong building, they meant to hit ours\nBetter evacuate all children, it's nuclear showers\nThere's nothing spookier\nYou now about to witness the power\n\n[Hook: 2Pac]\nWhen we ride on our enemies\nI bet you motherfuckers die, when we ride, on our enemies\nWhen we ride on our enemies\nBet all you motherfuckers die, when we ride, on our enemies\n\n[Verse 3: 2Pac]\nCome take a journey through my mind's eye\nYou crossed the game, don't explain, nigga time to die, say goodbye\nWatch my eyes when I pull the trigger\nSo right before you die you bow before a bigga nigga, now dry yo' eyes\nYou was HEARTLESS on yo' hits\nNiggas love to scream peace after they start some shit - pay attention\nHere's a word to those that robbed me\nI murder you then I, run a train on Mobb Deep! Don't fuck with me\nNigga you're barely livin', don't you got sickle cell?\nSee me have a seizure on stage, you ain't feelin' well, hell\nHow many niggas wanna be involved?\nSee I was only talkin' to Biggie, but I'll kill allay'all, then ball\nThen tell Da Brat to keep her mouth closed\nFuck around and get tossed up, by the fuckin' Outlawz\nBefore I leave, make sure everybody HEARD\nKnow I meant, every mother fuckin' word!\nWhen we ride on our enemies\n\n[Outro: 2Pac]\nWhen we ride on our enemies\nMake sure everybody die, when we ride, on our enemies\nWhen we ride on our enemies, hehe\nI make sure everybody die, when we ride, on our enemies", "image": "https://images.genius.com/dd39ab2c5a0e40527f33db1d9758a24d.500x500x1.jpg"}], "artist": "2Pac"}