{"songs": [{"title": "Big Pimpin (Live 1996)", "album": "Live At The House Of Blues", "year": "2005-10-03", "lyrics": "[Spoken Word Intro]\nYeah, c'mon\n(My bad)\nPut your hands in the air!\nC'mon, c'mon, c'mon, c'mon\n\n[Verse 1Daz]\nWoke up one morning out some bomb ass cock\nMy dick kinda limp so I cruise around the block\nCall my cousin Snoop as I swoop in the Coupe\nStop by my homey Dru house to puff on the loop\nSeen my little homey Style who I ain't seen in a while\nDamn near gone, floatin' on cloud one-nine\nLiquor store, so I grab some mixed gin and juice\nGot a quarter pound of bud so I'm fucked up too\nSeven, eight, nine, ten, eleven, twelve\nBailed back in the crib (For what?) Because I'm all-in\nConversated then I dug that hoe out\nI fixed me some food, then boned the hell out, and said\nTomorrow, tomorrow, check it out\nHere we go and we'll be back to dick you out\nG's up, hoes down\nIf she can't swim, she's bound to drown\nTwo A.M. on the dizot, I pause and I stizop\nI reminisce on that ass that I rizzocked\nNow I'm high as a kite\nYeahh, and I'm feelin' alright\nFour A.M. as I stoll back to my crib\nTo see what's with my woman and my newborn kid\nWith my mind on my money and my money on my mind\nWe do this everyday about the same time, beyotch!\n\n[Chorus: Nate Dogg]\nI was at the park one day, that's when I saw her face\nShe looked kind of cavi to me\n(Don't stop, c'mon)\nBut when I take her home, and tap that ass I'm gone\nI'm just a dog, don't blame me\nYeah\n\n[Snoop Doggy Dogg]\nNow do I love them hoes? (Hell nah!)\nAnd why is that? (Because you're Snoop Doggy Dogg\nAnd you never gave a fuck about a bitch\n'Cause to you, bitches ain't shit but hoes and tricks)\nHa ha, dee dee dadi dadi dah\nListen to the sounds from my nigga Doggy Dogg\nSlidin' through the city in the rag six-fo'\nHoppin' like a motherfucker tryin' to find a hoe\nHittin' all the spots but I'm comin' up blank\nI'm headed to the liquor store to get myself some drank\nParks my ride as I, steps inside, as I\nPuts my nine double-M to my side, as I\nContinue with my mission\nPussy is my dish and I'm fishin', wishin'\nUpon a star, to come up on some ends\nPushin' caviar, and a little bit of pussy\nSo I can get my pimp on\n'Cause my pen gets my pimp on from G to ozone\n\n[Outro]\nTell your friends bitch\nAll your friends bitch", "image": "https://images.genius.com/aceb98afaa438b9a1b348f7296ac142f.594x594x1.jpg"}], "artist": "2Pac"}