{"songs": [{"title": "Temptations (Battlecat Hip Hop Mix)", "album": null, "year": "1995-08-29", "lyrics": "[Intro: 2Pac & (Erick Sermon sample)]\n(Heyyyy! Heyy-ayyaahhyy)\nI know you feel me, you know, I know you feel me\nNow what you do is press rewind on this muthafucka\nAnd you gig, that's how we do this y'all, thug style\n\n[Verse 1: 2Pac]\nTell me, baby, are you lonely? Don't wanna rush ya\nI can help ya if you only, let me touch ya\nIf I'm wrong, Love, tell me\n'Cause I get caught up in the life I live, it's hell, see\nI never thought I'd see the day when I would calm down\nYou ain't heard? I've been known to clown and get around\nThat's my word, see you walkin' and you lookin' good\nYes indeed, got a body like a sex fiend, you're killin' me\nWith your attitude to match, right?\nDon't be phony, 'cause I hate it when you act like\nYou don't know me, I've be stressin' in the spotlight\nI want the fame, but the industry's a lot like\nA crap game, ain't no time for commitment, I gotta go\nCan't be with you every minute miss, another show\nAnd even though I'm known for my one night stand\nLook here, I wanna be an honest man, but temptations going...\n\n[Interlude: 2Pac & (Erick Sermon sample)]\n(Heyyyy! Heyy-ayyaahhyy)\nGive 'em the finger!\n(Heyyyy! Heyy-ayyaahhyy)\nAnd all my homies going\n(Heyyyy! Heyy-ayyaahhyy)\nGive 'em the finger!\n(Heyyyy! Heyy-ayyaahhyy)\nAnd you know what, baby, it's like...\n\n[Chorus: Easy Mo Bee]\nI know you've been searchin' for someone\nTo make you happy and get the job done\nYou say you needed a man with money\nBut I can't be there, and will you still care?\n\n[Verse 2: 2Pac]\nWill I cheat or will I be committed? Heaven knows\nGettin' weak and I wanna hit it, so here I go\nIn my ride and I'm all in\nGettin' high, I can hear the people callin'\nI'm passin' by, everybody knows I'm ballin'\nAnd to God, gotta keep myself from fallin'\nBut it's hard, all the cuties know I'm under pressure\nWhat do I do? Gettin' shaky when she pull the dress up\nAnd say it's cool, should I stroke\nOr should I wait a while? You decide\nIf you tell me that you don't want it, that's a lie\nMove close and let me whisper\nSome dirty words in your ears as I kiss ya\nOn every curve, slow down, baby, don't rush, I like it slow\nCan't hold it any longer so let it go\nOpen the gates to your waterfall up in heaven\nAnd don't worry, I let myself in, all I heard was...\n\n[Interlude: 2Pac & (Erick Sermon sample)]\n(Heyyyy! Heyy-ayyaahhyy)\nGive 'em the finger!\n(Heyyyy! Heyy-ayyaahhyy)\nYeah, you know what time it is\nAll my homies going\n(Heyyyy! Heyy-ayyaahhyy)\nDon't be heartbroke, baby, don't be heartbroke\nGive 'em the finger!\nThat's just the thug in me, girl, you know\nBut peep out how my homies do this shit...\n\n[Chorus: Easy Mo Bee]\nI know you've been searchin' for someone\nTo make you happy and get the job done\nYou say you needed a man with money\nBut I can't be there, and will you still care?\n\n[Verse 3: 2Pac]\nA lot of people think it's easy to settle down\nGot a woman that'll please me in every town\nI don't want 'em but I gotta do it\nThe temptation got me ready to release the fluid\nSensation, sit down and conversate\nLike you know me, take my hand\n'Cause even thugs get lonely, understand\nEven the hardest of my homies need attention\nCatch you blowin' up the telephone, reminiscin'\nI wanna take you to the movies and the park\nA quiet spot for you to do me in the dark\nNow that it's passion, hold me tight\nDon't need lights, I can see you by the moonlight\nI know your man ain't lovin' you right\nYou're lonely and depressed, you need a thug in your life\nEnough talkin', you want me to leave I'll get to walkin'\nSee you later, 'cause baby, I'm a player, and all I heard was...\n\n[Outro: 2Pac & (Erick Sermon sample)]\n(Heyyyy! Heyy-ayyaahhyy)\nYeah, you know, thug style, baby, thug style\nGive 'em the finger!\nDon't be mad at me, throw your hands up\nYo, this how we gonna do this, y'know?\nWe gon' freak the funk, freakin' it, you know?\nAy, but peep this, this how we run game on 'em\nCheck it out though, it's like...\n(Hey...hey...)\n(Heyyyy! Heyy-ayyaahhyy)\nUptown in the, give 'em the finger!\nIn the Bronx y'all, and Brooklyn\nAll over New York they're goin'\nOut in Oaktown, and Los Angeles\nYeah, out in Houston, and Baltimore\nYeah, Miami, all the way down south\nAnd up north where it's cold\nYeah, freak mode, baby, freak mode\nIt's the thug in me, I know you feel me", "image": "https://images.genius.com/fd02d85602ee7794c6f946f515f83100.500x500x1.jpg"}], "artist": "2Pac"}