{"songs": [{"title": "Live it up", "album": null, "year": null, "lyrics": "I ain't got no friends\n(take money) Yeah, I'ma do this track\nWest side!!\n(take money) MOB, Bad Boy killers\n(take money) Hahahaha, hey fat boy...\n(take money)\n\nVerse One: 2Pac\nFirst off, touch your chick and the clique you claim\nWestside when we ride, come equipped with game\nYou claim to be a player, but I bust your wife\nWe bust on Bad Boys, brothers touch for life\nPlus Puffy trying to see me, weak hearts I rip\nBiggie Smalls and Junior M.A.F.I.A. some mark-ass tricks\nWe keep on coming while we running for your jewels\nSteady gunning, keep on busting at them fools\nYou know the rules\nLittle Ceaser, go ask your homie how I'll leave you\nCut your trick ass up, leave you in pieces, now be deceased\nLil Kim, don't compensate for real G's\nQuick to snatch your ugly hair off the streets\nYou Little weave! I'll let them suckas know it's on for life\nDon't let the Westside ride the night haha\nBad Boy murdered on wax and killed\nMess with me and get your caps peeled\nYou know ... see ...\n\nChorus:\nGrab ya Glocks, when you see 2Pac\nCall the cops, when you see 2Pac, uhh\nWho shot me, but ya punks didn't finish\nNow ya bout to feel the wrath of a menace\nBusta, I hit em' up...\n\nInterlude: 2Pac\nYeah, straight out on the Bad Boy camp\nYou know how we do it\nAll my real homeboys in New York keep thuggin'\nAll the rest of you bustas die slow!\n\nVerse Two: Fatal\nGet out the way yo, Hussein Fatal\nBiggie Smallz just got dropped\nLittle Moo, pass the Mac, and let me hit him in his back\nFrank White need to get spanked right, for settin traps\nLittle accident murderer, and I ain't never heard-a ya\nPoisonous gats attack when I'm servin ya\nSpank ya shank ya whole style when I gank\nGuard your rank, cause I'ma slam you ass in the paint\nPuffy weaker than a block I run on you\nAnd I'll smoke ya junior mafia in front of you\nWith the ready power tuckin my Guess under my Eddie Bauer\nYa clout, pretty sour I get packages every hour\nAnd hit em up\n\nChorus\nGrab ya Glocks, when you see 2Pac\nCall the cops, when you see 2Pac, uhh\nWho shot me, but ya punks didn't finish\nNow ya bout to feel the wrath of a menace\nBusta, we hit em' up...\n\nVerse Three: 2Pac\nPeep how we do it, keep it real, it's penitentiary steel\nThis ain't no freestyle battle, all you suckers gettin\nKilled with ya mouths open\nTryin to come up offa me, you in the clouds hoping\nSmokin dope it's like a sherm high\nBrothers think they learned to fly\nBut they burn little suckers, you deserve to die\nTalkin bout you gettin money, but its funny to me\nAll you suckers living bummy, why you're messin' with me\nI'm a self made milionare\nThug Livin out a prison, pistols in the air, hahaha\nBiggie, remember when I used to let you sleep on tha couch\nAnd beg the trick to let you sleep in the house, ahh\nNow its all about Versace, you copied my style\nFive shots couldn't drop me, I took it, and smiled\nNow I'm bout to set the record straight, with my AK\nI'm still the thug that you love to hate\nLittle busta, I hit em up\n\nVerse Four: Kadafi\nI'm from N-E-W Jerz, where plenty murders occur\nNo point to comment , we bringin drama to all you herbs\nKnuckle check the scenario, Little Cease\nI bring you fake G's to your knees\nCoppin pleas in de janeiro\nBig Momma, is you coked up, or doped up?\nGet ya lil Junior whopper clique smoked up, Please tell me\nIs you STUPID?!?! I take money, crash and mash through Brooklyn\nWith my clique lootin, shootin and pollutin ya block\nWith 15 shots cocked Glock to your knot\nOutlaw mafia clique movin up another notch\nAnd you bast stops squaws get mopped and dropped\nAll your fake-ass east coast props brainstormed and locked\n\nVerse Five: Idi Amin\nYou is a, b writer, a Pac style taker\nI'll tell you to ya face you ain't nothin' but a faker\nSofter than Alizé with a chaser\nBout to get murdered for the paper\nIdi Amin approach the scene of the caper\nLike a loc, with Prodigy in a choke hold\nTotin smoke, Outlawz we ain't no joke\nThug Life, cowards betta be known, we approachin\nIn the wide open, guns smokin\nNo need for hopin its a battle lost, I got em crossed\nSoon as the funk is poppin off\nHAHA I hit em up\n\nOutro: 2Pac & Prince Ital Joe\nEmpty clips, set trip\nYou know what time it is\nWestside, Outlaw, Thug Life till we die\nCalifornia love, california thug\nYou know what time it is\nBad Boy Killa\nMobb Deep Killa\nChino XL Killa\nMuch love to Smiff-N-Wessun, Freddie Foxxx, Bunchy The Fat Bastard, Naughty By Nature and all the real thugs out there\n(Who fi broke-broke an who fi rich-rich)\nKeep it comin’!\n(Outlaw Immortal will never switch)\nWestsiiiide!\nYou know what time it is\n(Police informa, di bwoy dem a snitch)\nAll my real homeboyz in Jerzey\n(Live the thug life and get buried ina di ditch)\nGet up!\n(New York uno better respect 2PAC)\nOutlaw!\n(an di yute Big, dem proud to be black)\nThug Life! to die…\n(Jealousy some of them act idiot)\nWestsiiiide!\n(Hangin’ pondi corner an smoke nuff crack)\nOutlaw!\nLive it up or give it up, busta!\n(2PAC a di artical an dats a fact)\nHahahaha, Yeah!\n(so seh dis an so seh dat,)\nYou know what time it is\n(New York uno betta respect 2PAC,)\nLove bout you, hate about me\n(if uno diss, u will gonna get a gunshot)\n(take money) Gun talkin’ automatic mins`\n(Outlaw Immortal will come an attack)\n(take money) eleven’s, fo’teens\n(radical posse,as we have thug life back)\nWhatever!\n(Jamaican posse, yes, we love 2PAC,)\nYou wanna see us? Have you punks wannabe’s\n(warrior black an di yute nuh smoke crack)\nBad Boy killers, we the realest, whatever!\n(New York uno better respect 2PAC,)\nWe got, together, Outlawz!\n(an di yute big, dem proud to be black)\nThugs to the realest, feel us\n(Jealousy some of them act idiot)\nAll you suckas die\n(Hangin’ pondi corner an smoke nuff crack)\nSlow, my fo’fo’, go, bow-bow\n(2PAC a di artical an dats a fact)\nKastro, Idi, close my foes\n(so seh dis an so seh dat,)\nWithout love, no love, do ya\n(respect to my bredren 2PAC)\n(take money) You knew it!\n(Respect to the hard to kill yute)\nIt came with it, we bought it, we court it, THUG LIFE!\n(Now I don’t give a damn about what everybody said)\nForever, together, we ride, we die, we high\n(y’all understand?)\n(if ya don’t know somebody you ain’t supposed to judge em)\nFOREVER!\nTHUG LIFE!\n(that yute big ya done)\nOUTLAW RIDAHZ!\nWESTSIIIIIDE!\nM.O.B.! *echoes*", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}