{"songs": [{"title": "Hit Em Up (Live)", "album": "2Pac Live", "year": "2018-08-10", "lyrics": "[Spoken Word Intro]\nNigga we are...\nYeah\nHey, yo, I think y'all gonna like this next song\nWhen this song drop, I want all the West Coast people to give up some love when this song come on. They tried to boo this song. They don't wanna play my song, but they wanna play fat boy all damn day\n\n[Intro]\nWhat, c'mon, c'mon\n(Take money)\nC'mon, c'mon\n(Take money)\nC'mon, c'mon\nWhat's up nigga?\n\n[Verse 1]\nFirst off, fuck yo' bitch and the clique you claim\nWestside when we ride, come equipped with game\nYou claim to be a player, but I fucked your wife\nWe bust on Bad Boys, niggas fucked for life\nPlus, Puffy tryna see me, weak hearts I rip\nBiggie Smalls and Junior M.A.F.I.A. is some mark-ass bitches\nWe keep on comin' while we runnin' for your jewels\nSteady gunnin', keep on bustin' at them fools, you know the rules\nLil' Caesar, go ask your homie how I'll leave ya\nCut your young-ass up, leave you in pieces, now be deceased\nLil' Kim, don't fuck around with real G's\nQuick to snatch yo' ugly ass off the streets, so fuck peace!\nI'll let them niggas know it's on for life\nDon't let the Westside ride tonight\nBad Boy murdered on wax and killed\nFuck with me and get yo' caps peeled, you know\nMy niggas say\n\n[Chorus]\nSee, grab your Glocks when you see 2Pac\nCall the cops when you see 2Pac, uh\nWho shot me? But you punks didn't finish\nNow you 'bout to feel the wrath of a menace\nNigga, I hit 'em up!\n(Take money)\n(Take money)\n(Take money)\nWest Coast for life\n\n\n[Verse 2]\nGet out the way yo, get out the way yo\nBiggie Smalls just got dropped\nLittle Moo', pass the MAC\nAnd let me hit him in his back\nFrank White needs to get spanked right for settin' traps\nLittle accident murderer\nAnd I ain't never heard of ya\nPoisonous gats attack when I'm servin' ya\nSpank ya, shank ya whole style when I gank\nGuard your rank 'cause I'ma slam your ass in the paint\nPuffy weaker than the fuckin' block I'm runnin' through, nigga\nAnd I'm smokin' Junior M.A.F.I.A. in front of you, nigga\nWith the ready power\nTucked in my Guess under my Eddie Bauer\nYour clout petty/sour\nI push packages every hour\nHit 'em up!\n\n[Chorus]\nOh, call the cops when you see 2Pac, uh\nWho shot me? But you punks didn't finish\nNow you 'bout to feel the wrath of a menace\nNigga, we hit 'em up!\n\n[Verse 3]\nPeep how we do it, keep it real as penitentiary steel\nThis ain't no freestyle battle, all you niggas gettin' killed\nWith your mouths open\nTryna come up off of me, you in the clouds hopin'\nSmokin' dope, it's like a sherm high\nNiggas think they learned to fly\nBut they burn, motherfucker, you deserve to die\nTalkin' about you gettin' money, but it's funny to me\nAll you niggas livin' bummy while you fuckin' with me\nI'm a self-made millionaire\nThug livin', out of prison, pistols in the air (Ha, ha)\nBiggie, remember when I used to let you sleep on the couch\nAnd beg a bitch to let you sleep in the house?\nNow it's all about Versace, you copied my style\nFive shots couldn't drop me, I took it and smiled\nNow I'm back to set the record straight\nWith my AK, I'm still the thug that you love to hate\nMotherfucker, we hit 'em up!\n\n[Verse 4]\nI'm from N-E-W Jers' where plenty of murders occurs\nNo points or commas, we bring drama to all you herbs\nNow go check the scenario: Lil' Cease\nI'll bring you fake G's to your knees, coppin' pleas in de Janeiro\nLittle Kim, is you coked up or doped up?\nGet your little Junior Whopper click smoked up\nWhat the fuck, is you stupid?\nI take money, crash and mash through Brooklyn\nWith my click lootin', shootin' and pollutin' your block\nWith a 15-shot cocked Glock to your knot\nOutlaw MAFIA clique movin' up another notch\nAnd your pop stars popped and get mopped and dropped\nAll your fake-ass East Coast props brainstormed and locked\n\n[Verse 5]\nYou's a beat biter, a Pac style taker\nI'll tell you to your face you ain't shit but a faker\nSofter than Alize with a chaser\nAbout to get murdered for the paper\nE.D.I. Mean approach the scene of the caper\nLike a loc, with Little Ceas' in a choke\nGun totin' smoke, we ain't no motherfuckin' joke\nWe them niggas, better be knowin'\nWe approachin' in the wide open, gun smokin'\nNo need for hopin', it's a battle lost\nI got 'em crossed as soon as the funk is boppin' off\nNigga, we hit 'em up!\n\n[Chorus]\nWe hit  him up\nCall the cops when you see 2Pac\nSay what? (Come on with the next shit)\nCall the cops when you see 2Pac\nWho shot me? But you punks didn't finish\nNow you 'bout to feel the wrath of a menace\nNigga, we hit 'em up!", "image": "https://images.genius.com/19ab47132d55172513fea74b3b39e251.394x394x1.jpg"}], "artist": "2Pac"}