{"songs": [{"title": "Im Losin’ It (Original Version)", "album": "Thug Life Vol. 2 (Original Unreleased Outtakes)", "year": null, "lyrics": "[Scareface Movie Sample]\nYou need people like me so you could point your fucking fingers and say that's the bad guy[Verse 1: 2Pac]\nLord help me, save me, mama keep praying\nFor a young motherfucker trying to duck an early grave\nIn the city where ya can't tell the fakes from the snakes\nAnd the snakes from the phonies, enemies of homies\nAround the corner there's another nigga waiting to jack\nHe don't know I got a Glock 'til his ass get shot\nJust like a motherfucking thug disease\nCraving beats like they motherfucking drugs to me, hey\nWhat's up with bitches trying to screw me? Do me I did a movie\nThrow the pussy to me but before they never knew me\nRather die then let ya play me for a, buster\nAnd with my Glock I'm a plotting ass rotten motherfucker, huh\nDon't let the movie fool ya, let me school ya\nScreaming Thug Life nigga when I do ya\nI'm going crazy, getting dizzy\nAnd then I snap again, a motherfucking breather bring me back\nI'm telling ya I'm losing it\nHahahaha losing it!\nYeah\n\n[Scareface Movie]\nYou wanna play rough? okay\nOkay surrender ha?\nYou want more?[Verse 2: Big Syke]\nI'm going crazy, niggas can't fade me\nOn the real I kill when I step to ya fucking grill\nSo let me kick it let me flip it, let me get wicked\nI'm not a buster from the hood selling wolf tickets\nI hang with G's flipping keys and smoking weed\nI get the cash and dash and never learn to read\nSo fuck a bitch, fuck a ho and I let ya know\nBecause they come and go like the wind blows\nWhat am I giving how I'm living what I'm giving up\nYou can take my life and I don't give a fuck\n'Cause I'm the trouble most coming from the west coast\nWhere the niggas is banging 'til the overdose\nKillers and murderers, psychos and lunatics\nNobody knows what makes my mind clicked\nIs it the demons, screaming inside of me?\nHell no it's just the Thug Life mentality\nI'm going crazy shit don't phase me\nI'm living like a thug 'til six niggas carry me\nDeath is on the trigga so pull it\nI can't take it no more, nigga, I'm losing it\n\n[Scarface movie sample]\nSay hello to my little friend(we all going die nigga we all goin' die)\nyou wanna play rough okay\nOkay stop ha?\nOkay surrender ha? You want more?[Verse 3: Spice 1]\nShit was talking to me, my gat screamed fire\nThe bullet told me shoot that motherfucker he's a liar\nI talked to me 3-80 like a bitch on a stroll\nWhen niggas try to dig me, I hold off and let a hoe\nNigga, I can't get fucked in this game I'm a psychopath\nMy AK told me to shove him up some niggas ass\nI'm having long conversations with Mr. Millimeter\nHe's one of my best friends bitch ass nigga eater\nAnd Miss Mossberg love it in the back trunk\nYou know that old school bitch she like to get it funked\nAnd spitting motherfuckers by the seems\nMy grand daddy Mr. AR-15\nBy the evil motherfucker\nTalked me into taking over a dope turf and shooting cluckers\nSaid he was my only family\nShoot straight, and please don't jam me\nGot in a fight at the club my gat started talking\nTold me to shut the fuck up and let him do the talking\nI woke up and it was sick to see the guts hang\nI'm going nuts man\nShit was talking to me\n\n[Outro]\nYeah, foo' I'm going nuts straight gat shit up\nMotherfucker livin' a thug life\nYeah motherfucker, Spice 1, nigga", "image": "https://images.genius.com/6a6dee4a6e7f963edc023852819edc3b.500x500x1.jpg"}], "artist": "2Pac"}