{"songs": [{"title": "All About U (Live 1996)", "album": "Live At The House Of Blues", "year": "2005-10-03", "lyrics": "[Pre-Recorded Audio: 2Pac]\nChange? Shit\nI guess change is good for any of us\n\n[Intro]\n(C'mon) Yeah!\n(It's all about you, one time)\nWhere my ladies at? Where my ladies?\nIt's all about you\n(Turn it up, turn it up)\nTurn that shit up man!\n(Fuck that shit!)\nNot the mic!\n\n[Verse 1]\nYou probably crooked as the last trick\nWant to laugh 'bout how I got my ass\nCaught up with this bad bitch?\nThinkin' I had her, but she had me in the long run\nIt's just my luck, I'm stuck with fuckin' with the wrong one\nWise decisions, based on lies we livin'\nScandalous times, this game's like my religion\nYou could be rollin' with a thug\nInstead you with this weak scrub, lookin' for some love\nIn every club, I see you starin' like you want it\nWell, baby, if you got it, better flaunt it\nLet the liquor help you get up on it\nI'm still tipsy from last night\nBumpin' these walls as I pause, addicted to the fast life\nI try to holla, but you tell me you taken\nSayin' you ain't impressed with the money I'm makin'\nGuess it's true what they tellin' me\nFresh out of jail, life's hell for a black celebrity\nWell that's the reason why I call, and maybe you with it\nFantasies of us kissin', can I kick it?\nAddicted to the things you do\nBut still true what I'm sayin', boo, ‘cause this is all about you\n\n[Chorus]\nEvery other city we go, every other video\nIt's all about you\nNo matter where I go, I see the same ho\nC'mon G\nEvery other city we go, every other video\nIt's all about you\nNo matter where I go, I see the same ho\n\n[Verse 2]\nI make a promise if you go with me, just let me know\nI'll have you hollerin' my name out before I leave\nNobody loves me, I'm a thug nigga\nI only hung out with the criminals and drug dealers\nI love niggas ‘cause we comin' from the same place\nWitness me holla at a hoochie, see how quick the game takes\nHow can I tell her I'm a playa and I don't even care?\nCreep low, weed smoke's in the air\nEverywhere I go, it's all about the groupie hoes\nWaitin' for niggas at the end of every show\nI just seen you in my friend's video\nNow I don't put a bitch before my friends, so here we go\nFollow the leader and peep the drama that I'm goin' through\nIt's all about you\nYou, you, you, you\nAnd you, and you\n\n[Chorus]\nEvery other city we go, every other video\nIt's all about you\nNo matter where I go, I see the same ho\n(This ain't just for the ladies)\n(This for some of the niggas too)\nEvery other city we go, every other video\nIt's all about you\nNo matter where I go, I see the same ho\n\n[Verse 4]\nYou couldn't hold me back, it'd take a fatter track\nA lyrical attack, perhaps, it was a visual bluff\nWhen I started to snaps all your rode 'em swoll\nStraight in control, flows'll fold, while hoes cold stroll\nHold the set, I told Dramacy' go in next\nGold diggin', cold diggin' a gold Rolex\nI slide in easily, try a grizzly\nSluts know the cut, I came to fuck, try skeezin' me\nRunnin' up in ya just like Bruce Jenner when I bend ya\nAt the most, I fucked a bitch from the West Coast to West Virginia\n\n[Outro]\nUh, uh\nIt's like that\nAnd, and\nIt's all about you", "image": "https://images.genius.com/aceb98afaa438b9a1b348f7296ac142f.594x594x1.jpg"}], "artist": "2Pac"}