{"songs": [{"title": "This Life I Lead (O.G. Version)", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nIn this motherfuckin' life I lead, shit\nA hell of motherfucking road blocks\nAnd crooked cops\nWe still ride though\nWhat side? Westside\n\n[Verse 1: 2Pac]\nI want money in large amounts\nMy garage full of cars that bounce\nMovin' my tapes in major ways, ‘cause every dollar counts\nBusters is jealous and half these niggas is punks\nThey runnin' off at the mouth 'til I fill it up with my pump\nThey jump, my automatic keep 'em wary\nWhy you frontin' like you Billy Badass? Nigga, you scary\nI've been knowin' you for years\nWe was high school peers, in junior high\nI was itchin' to kill, and you was ready to die\nWhile you bullshittin', niggas was dyin' and catchin' cases\nBustin' my automatics at motherfuckers in foreign places\nLeavin' no trace, they see my face and they buried\nThem bitches die in a hurry, still I ride, I'm never worried\nMr. Makaveli tell me to ride, and I'ma ride\nPick my enemies out the crowd, and motherfuckers die\nIt's not the way I wanna live, my nigga, it's how it is\nHomie got into a fight last night that killed his kids\n\n[Hook: 2Pac]\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers 'til we die\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers\n'Til we die, in this life I lead\n\n[Verse Two: Gonzoe]\nI stopped to think, rolling a Philly up full of dank\nPouring the remaining of my Remy Martin down the sink\nBack to get dressed, grab my strap in case I'm tested\nChronic and Stress, await the bitch to clean my mess\nWishing I was sober not fucked up, with a hangover\nThe homie just released, so the whole hood came over\nThe west side bash, they're piecing on dime bags\nMacking in the living room, shaking that ass\nTalking fast to whores, we pros at what we do\nIt's on and popping once we get this bitch full of brew\nI knew some shit might crack so we strapped and all thick\nSwerving the niggas I see, who ain't invited to this shit\nGive a Fuck! the life I live, that's how it is\nFuck around you will be crying, missing your kids\nHUH! My destiny in this motherfucking game;\nIs either to get rich or die\n\n[Hook: 2Pac]\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers 'til we die\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers\n'Til we die, in this life I lead\n\n[Verse Three: Daz Dillinger]\nWhen they see that nigga Daz they say I'm dangerous\nIn this strange world; believe who just don't give a fuck\nI mean I stroke with the intentions, cuttin' it up like I supposed to\nMy job is to protect and rob and serve you\nWho hold the genius? - we done left, Death Row is breathin'\nHeaters gotta get served til none has left breathin'\nWhat I'm achieving, smoking weed and fucking hoes\nAin't going nowhere, no man is going to strive, be on a stroll\nI gotta make it happen everyday and all day\nI gotta make my hustle and come back with big pay\nTear up the spot lay, creating ruckus when I touch down\nWho got my back when they put the attack down?\nSo I lay out cold, petrified, terrified\nBarely alive, come again when niggas start to ride\nWith the Outlawz and Pounders, blast, I'm clownin' on three\nNigga you're my motherfuckin' enemy\n\n[Hook: 2Pac]\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers 'til we die\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers\n'Til we die, in this life I lead\n\n[Verse Four: Kurupt]\nThat's right! - that's right! Terrordome, where it's on\nFrom selling dope, coke, to crack\nYoung Gotti, entered the party from the back\nInstant pay; I gots to do it my way\nDeserve to swerve on the highway\nCause the spot is sewn from Monday to Friday\nNigga try me, I like the Indica and Ty Weed\nDefy me, Young Gotti, when I be high as the sky be\nVerbal homicide, be ready to rupture\nMaking moves to touch ya, disassembles your whole structure\nI makes money, cause that's all I know how to make\nThat's all I learned when I was young, no hesitation or mistakes\nI see a pot, filled with nothing but rocks and knots\nMidnight complexion, Glocks to shake spots\nThey see my people, so they already assume I live illegal\nBut they assume too soon\nI got a treat for every bitch on the street\nI role with beat, I got a problem, I got a fixation for heat\n\n[Verse Five: Nutt-So]\nThe life I live is treacherous, no one stands next this\nBut still motherfuckers be trying to fetch this\nNutty nigga that brings heat to your set\nUnloading two two threes until your ass breathes death\nNigga, East Side, Oakland, no joking, we kick up dust\nNo remorse, so you and your boys can suck these Nuts\nExtended clips left his nose sanded, I'm right handed\nBut when it comes to the pistol bumping; I'm both handed\n\n[Hook: 2Pac]\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers 'til we die\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}