{"songs": [{"title": "Toss It Up (Nu-Mixx)", "album": "Nu-Mixx Klazzics", "year": "2003-10-07", "lyrics": "[Verse 1: 2Pac]\nLord have mercy, father help us all\nSince you supplied your phone number, I can't help but call\nTime for action, conversating, we relaxing, kicking back\nGot you curious for thug passion, now picture that\nTongue-kissing, hand full of hair, look in my eyes\nTime to make the bed rock, baby look how it rise\nMe and you moving in the nude, do it in the living room\nSweating up the sheets, it's the Thug in me\nI mean no disrespecting when I tongue-kiss your neck\nI go a long way to get you wet, what you expect?\nLate night, hit the highway, drop the top\nI pull over, getting busy in the parking lot\nAnd don't you love it how I lick your hips and glide?\nKiss you soft on your stomach, push my love inside\nGot you lost in a love zone, stuck in the lust\nI got the bedroom shaking, back-breaking\nWhen we're tossing it up\n\n[Verse 2: Danny Boy & JoJo]\nFeel this baby, I like the way it's going down\nWhen nobody's around, slip-slide ride\nGiving me that nice smile\nFemale I like, what I want to give all night\nYou and me alone, everybody's gone, toss it up\nBaby, let's get it on!\nI like the way you please me, baby\nThe sexy way you tease me, shorty\nThe way you move your body\nIt really drives me crazy\nYour body's hypnotizing, your smell is so exciting\nSo baby come on home with me\nI like the way you give it to me, baby\n\n[Chorus: Danny Boy & JoJo]\nI like the way you give it to me\nLet me see you toss it up\nSaid I like the way you give it to me\nLet me see you toss it up\nI like the way you give it to me\nLet me see you toss it up\nSaid I like the way you give it to me\nLet me see you toss it up\n\n[Refrain]\nPlay on, play on, play on, play on\nPlay on, play on, play on, play on\nPlay on, play on, play on, play on\nPlay on, play on, play on, play on\n\n[Verse 2: K-Ci & Aaron Hall]\nOh, it's K-Ci, baby, mmm, that want you lady\nOh, don't act so shady\nBaby, your taste as fine as gravy\nThe way you move that thang, you make me wanna sing\nGirl, you make my bells ring, make them go ting-a-ling!\nNasty man, I'm here again\nDon't want it to ever end\nIt's feeling too good\nGimme some more, oh lady, lady\nYour body the kind I like-ah\nBig booty titillating delight-ah\nBack it up yo, let me in there\nToss it up for me\n\n[Chorus: K-Ci & Aaron Hall]\nI like the way you give it to me\nLet me see you toss it up\nI like the way you give it to me\nLet me see you toss it up\nSaid I like the way you give it to me\nLet me see you toss it up\nI like the way you give it to me\nSo won't you play on\n\n[Verse 3: 2Pac]\nHow do you want it? What's your phone number? I get around\nCali Love to my true Thugs, picture me now\nStill down for that Death Row sound, searching for paydays\nNo longer Dre Day: arrivederci\nGone and forgotten, rotten for plotting Child's Play\nCheck your sexuality, as fruity as this Alizé\nQuick to jump ship, punk trick, what a dumb move\nCross Death Row, now who you gonna run to?\nLaugh at you suckers 'cause you similar\nPretending to be hard, oh my God, check your temperature\nScreaming \"Compton,\" but you can't return, you ain't heard?\nBrothers pissed 'cause you switched and escaped to the 'burbs\nMob on to this new era, cause we untouchable\nStill can't believe that you got 'Pac rushing you\nUp in you, bless the real, all the rest get killed\nWho can you trust? Only time reveals\nToss it up\n\n[Chorus: K-Ci & Aaron Hall]\nLet me see you toss it up\nLet me see you toss it up\nLet me see you toss it up\nLet me see you toss it up\n\n[Outro: 2Pac]\nToss it up, haha, yeah, no doubt\nWe send this shoutout...no doubt\nAnd to Lil' Kim who ain't little no more\nGirl, you ain't checked the weight scale lately, have you?\nYou are not little Kim, you fat, get it straight\nToss it up\nPuffy, I read your little interview, buddy\nYou still ain't touching us\nAll that peace talk, look\nI don't care if you kiss my ass from here to across the street, boy\nIt's on! Toss it up\nYeah, we took y'all beat\nYou know who beat we took, yeah, we took y'all beat\n'Cause you wasn't rocking it right\nI'm tired of suckers rocking beats that don't belong to them\nThis our rap game, this our beat and we tossin' it up\nDeath Row, Westside, you know it's on", "image": "https://images.genius.com/9c7e095edc751d01f9efc1a0fc09f646.297x297x1.jpg"}], "artist": "2Pac"}