{"songs": [{"title": "Killuminati (OG Original Version)", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nMakaveli the Don, break on 'em!\nAh put ya, ah put ya hands on ya, hands on ya heater\nHands on ya, hands on ya heater, hands on ya, hand…\n\n[Verse 1: 2Pac]\nLet it be prophesized; niggas'll die because your crew's doom\nAround the way niggas get murdered by the full moon\nHeard it in whispered tones, niggas is bold and they choose to roll\nI kill 'em all, watch now, nigga, truth be told\nWestside was the war cry, look how they scatter\nNiggas dyin' by my 30 odd, brains is splattered\nWonder why these niggas cross me, I'm certified crazy\nSo sick the world made me\nNow diggy-die, every time I ride is for reasons\nHard to kill a nigga 'cause I'm comin' back like Jesus\nBow down to my ill nation, runnin' from drug cases\nLookin' at my congregation so full of thug faces\nMama gave a nigga breath, a life of stress\nI invest in a vest and makin' niggas watch they every step\nLabel me a threat and I ain't even got started with this shit yet\nThug style, baby, hands on my pistol, listen\nI'm a rider, every nigga breathin' pay attention\n'Bout to show you motherfuckers how it feel to drop a body\nA simple glimpse of my lifestyle, Killuminati…\n\n[Chorus: (Kastro) & 2Pac]\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n\n[Verse 2: 2Pac]\nAfter the fire comes the rain, after the pleasure there's pain\nEven though we broke for the moment, we'll be ballin' again\n'Til I make it, yo, my military be prepared for them bustaz\nSimilar to bitches too scary, get too near me, we rushin'\nVisions of over-packed prisons, millions of niggas thug livin'\nPressures and three strikes, I hope they don't test us\nThey pull the heat out, ammunition in crates\nPsssh! Move without a sound as we slide down pistols in place\nThey got me fiendin' for currency, the money be callin'\nIt’s like I’m - dreamin', seein' scenes of me ballin'\nParticipated in felonious behavior\nCock the cocked 4-5, snatchin' niggas pagers\nLabeled a mark soon as we start, it was hard to quit\nWe started out drinkin' 40's, moved to harder shit\nGoddamn, now I'm a grown man, I follow no man\nNigga got my own plan, and it's called Killuminati\n\n[Chorus: (Kastro) & 2Pac]\n(Yo, Makaveli, they can't stop you)\n(Killuminati and we got you, got you)\nKilluminati\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n\n[Verse 3: E.D.I. Amin]\nCheck it, I spend most of my time hatin' niggas\nWantin' to bank niggas, because they come across as fake niggas\nBut we made niggas, old school in our thinkin'\nWhile you sinkin', I comes out, fucked up, high as hell, drinkin'\nOutlawz could never be bullshitters, what\nWe keeps it too assassin, none of y'all can deal with us\nGot me thinkin' who's still with us or who haters\nIt don't matter 'cause put together none of y'all could take us\nY'all don't understand, I'll kill for this nigga, peel for this nigga\nAnd when y'all dump out, be the shield for this nigga\nE.D.I. Amin, ooh, Lordy Lordy\nKill 'em all for shorty, '96, it's Killuminati\n\n[Verse 4: Kadafi]\nThey got me thinkin' strugglin' and hustlin's my only fate\nToppin' grams on the kitchen plate\nTryin' to keep that money straight\nTimes is where I be up on these streets sleep\nBut when I crack, hammer cocked back, wrapped in my sheets\nMy life's been crossed, crooked since a seed\nThirteen, got a package from the devil, payin' my deeds\nPreoccupied by the greed in this crooked life I lead\nMore funds to spend or bigger guns to squeeze\nMe and my thugs clock G's, sippin' naughty thangs\nReal as these tats on my body, and it's Killuminati\n\n[Chorus: (Kastro) & 2Pac]\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n(Yo, Makaveli, they can't stop you)\nHold it down!\n(Killuminati and we got you, got you)\n\n[Outro: 2Pac]\nMakaveli up in this bitch, worldwide mash, Westside\nThe question when asked, nigga, you know what time it is\nYou know what type of shit we giving you\nYou want that hip-hop, nigga, this that hip-hop for real\nHip-hop that sell five mill'\nFuck with me, nigga, you get killed\nIt don't get no realer than real\nWhat's my motherfuckin' name, nigga? Like my nigga Dogg asked\nWhat's my muh'fuckin name, nigga?\nWhat's my muh'fuckin name?\n(Makaveli the Don until I'm gone, I maintain)\nOutlawz in this bitch, Death Row at it's finest\n(Makaveli the Don until I'm gone, I maintain)\nRepeat! Death Row at it's finest, nigga\nYou know what time it is\n(Makaveli the Don until I'm gone, I maintain)\nOutlawz, Makaveli, Kastro, EDI Mean, Kadafi, Hussein\nNapoleon, Young Noble, the whole clique\nRough, rugged, and raw, QDIII in this biatch\nWestside all in this biatch!\nTommy D. Woodstockin' it and shit, you know'm'sayin', hahaha\n(Makaveli the Don until I'm gone, I maintain)\nDeath Row! (They can't stop you)\nMade niggas and we out to get paid, nigga\n(Makaveli the Don until I'm gone, I maintain)\nMade niggas and we out to get paid, nigga\n(Makaveli the Don until I'm gone, I maintain)\nI maintain, made niggas and we out to get paid, nigga\nWestsizide!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}