{"songs": [{"title": "Picture Me Rollin’ (Outlawz Remix)", "album": "Nu Mixx Klazzics Vol. 2 (Mixtape)", "year": "2007-08-14", "lyrics": "[Intro: 2Pac]\nYeah, clear enough for ya? (Alright)\nWhy niggas look mad?\nY'all supposed to be happy I'm free\nY'all niggas look like y'all wanted me to stay in jail\nHo bustas!\n\n[Verse 1: 2Pac]\nPicture me rollin' in my 500 Benz\nI got no love for these niggas, there's no need to be friends\nThey got me under surveillance\nThat's what somebody be tellin'\nKnow there's dope bein' sold, but I ain't the one sellin'\nDon't want to be another number\nI gotta puff a gang of weed to keep from goin' under\nThe Federales wanna see me dead\nNiggas put prices on my head\nNow I got two Rottweilers by my bed, I feed 'em lead\nNow I'm released, how will I live?\nWill God forgive me for all the dirt a nigga did, to feed kids?\nOne life to live, it's so hard to be positive\nWhen niggas shootin' at your crib\nMama, I'm still thuggin', the world is a war zone\nMy homies is inmates, and most of them dead wrong\nFull grown, finally a man, just schemin' on ways\nTo put some green inside the palms of my empty hands\nJust picture me rollin'\nFlossin' a Benz on rims that isn't stolen\nMy dreams is censored, my hopes are gone\nI'm like a fiend that finally sees when all the dope is gone\nMy nerves is wrecked, heart beatin'\nAnd my hands are swollen\nThinkin' of the G's I'll be holdin'; picture me rollin'\n\n[Chorus: 2Pac + (Danny Boy)]\n(Picture me rollin')\nCan you see me now?\n(Picture me rollin')\nMove to the side a little bit so you can get a clear picture\nCan you see it? Haha, picture me rollin'\n(Picture me, picture me rollin')\nYeah, nigga\n(Picture me rollin', picture me)\n\n[Verse 2: Napoleon]\nI've got a mind full of money, the beats is who I talk to\nAnd when it ain't painting, picture me rollin' on a walkthrough\nAnd now tell 'em remix this\nIt don't matter how they try to do it, homie, we this shit\nThe truth and them powers can quote us\nBut they don't tell the truth in their music 'cause it might promote us\nThe money don't stop when a nigga get knocked off\nThe world don't stop 'cause the homie get popped off\nWe far away from addicts but we right where the static at\nAnd we don't stand around to get money, you niggas mad at that\nMama ain't raise no chumps, so when it's on, I'm on it\nPump 12-gauge ready to dump\n\n[Verse 3: Young Noble]\nListen, they'd rather see me dead or in jail than to see me rich\nThat's why I drive by slow, take a picture, bitch\nI'm in the triple black 745\nOn the grind getting back what's mine\nMiddle finger to the law, the realest that you ever saw\nLiving my life and I'ma die a fuckin' outlaw\nWe on the verge of greatness, the hood embraced it\nFrom the corners to the cell blocks, the code is sacred\nFrom the bricks of Compton, made nigga Mafia ties\nYa hear me, Killa Kadafi sunrise\nListen, can you picture all my TECs getting bigger\nThese niggas respect pressure and we only getting better, you feel me?\n\n[Chorus: 2Pac + (Danny Boy)]\nCan you see me now?\n(Picture me rollin')\nMove to the side a little bit so you can get a clear picture\nCan you see it? Haha, picture me rollin'\n(Picture me, picture me rollin')\nYeah, nigga\n(Picture me rollin', picture me)\n\n[Verse 4: E.D.I. Mean]\nI got my two-tone Sig, brains blown big\nAnd I'm flying down the freeway on the way to getting rich\nI ain't trippin' on no bitch, my mind on cash\nAll these hating muh'fuckas thinking I ain't gon' last\nI'm a 10-year vet, rep built on respect\nIf it ain't about some chips or a check, eat a dick\nYeah, I'm shining up my shoes when I cruise, niggas get the blues\nHoes go \"ooh\" when they see how  the roof move\nDude is a fool, mayne, the cops can't catch him\nHood niggas know he an Outlaw retched\nCome through the block, spread love everywhere\nPut something in the air then I'm rollin'; picture me rollin'\n\n[Outro: 2Pac]\nIs y'all ready for me?\nPicture me rollin' role call\nYou know there's some muh'fuckers out there\nI just could not forget about\nI wanna make sure they can see me\nNumber one on my list: Clinton Correctional Facilities\nAll you bitch-ass CO's\nCan you niggas see me from there?\nBallin' on y'all punk-ass!\nPicture me rollin', baby!\nYeah, all them niggas up in them cell blocks\nI told y'all niggas when I come home it's on\nThat's right, nigga, picture me rollin'\nOh, I forgot! The DA\nYeah, that bitch had a lot to talk about in court\nCan the ho see me from here?\nCan you see me, ho? Picture me rollin'\nAnd all you punk police, can you see me?\nAm I clear to you?\nPicture me rollin', nigga, legit\nFree like O.J. all day, you can't stop me\nYou know I got my niggas up in this motherfucker\nManute, Pain, Syke, Bogart, Mopreme\nIt's sad, dog, can you picture us rollin'?\nCan you see me, ho?\nIs y'all ready for me? We up out this bitch\nAny time y'all wanna see me again\nRewind this track right here\nClose your eyes, and picture me rollin'", "image": "https://images.genius.com/3df7ac2293876c8e607489cd6238694a.220x220x1.jpg"}], "artist": "2Pac"}