{"songs": [{"title": "So Many Tears (Key Of Z. Remix)", "album": "So Many Tears (Maxi-Single)", "year": "1995-06-13", "lyrics": "[Intro]\nI shall not fear no man but God\nThough I walk through the valley of death\nI suffered through the years, and shed so many tears\nIf I should die before I wake\n(I've shed so many tears)\nPlease God walk with me\nGrab a nigga and take me to Heaven\nForgive me for my sins, let me into Heaven\n(Don't wanna cry no more)\nI lost so many peers, and shed so many tears\n\n[Verse 1]\nBack in elementary, I thrived on misery\nLeft me alone, I grew up amongst a dyin' breed\nInside my mind couldn't find a place to rest\nUntil I got that Thug Life tatted on my chest\nTell me, can you feel me? I'm not livin' in the past\nYou wanna last? Be the first to blast\nRemember Kato, no longer with us, he's deceased\nCall on the sirens, seen him murdered in the streets\nNow he rest in peace\nIs there a heaven for a G? Remember me\nSo many homies in the cemetery, shed so many tears\n\n[Refrain]\nLord, I suffered through the years\nAnd shed so many tears\n(I've shed so many tears, don't wanna cry no more)\nLord, I lost so many peers\nAnd shed so many tears\n\n[Verse 2]\nNow that I'm strugglin' in this business, by any means\nLabel me greedy gettin' green, but seldom seen\nAnd fuck the world 'cause I'm cursed\nI'm havin' visions of leavin' here in a hearse\nGod, can you feel me?\nTake me away from all the pressure and all the pain\nShow me some happiness again\nI'm goin' blind, I spend my time in this cell, ain't livin' well\nI know my destiny is Hell, where did I fail?\nMy life is in denial and when I die\nBaptized in eternal fire, shed so many tears\n\n[Refrain]\nLord, I suffered through the years\nAnd shed so many tears\n(I've shed so many tears, don't wanna cry no more)\nLord, I lost so many peers\nAnd shed so many tears\n\n[Verse 3]\nNow I'm lost and I'm weary, so many tears\nI'm suicidal, so don't stand near me\nMy every move is a calculated step\nTo bring me closer to embrace an early death\nNow there's nothin' left\nThere was no mercy on the streets\nI couldn't rest, I'm barely standin'\nAbout to go to pieces, screamin' peace\nAnd though my soul was deleted, I couldn't see it\nI had my mind full of demons tryin' to break free\nThey planted seeds and they hatched, sparkin' the flame\nInside my brain like a match, such a dirty game\nNo memories, just a misery\nPaintin' a picture of my enemies killin' me in my sleep\nWill I survive 'til the morning to see the sun?\nPlease Lord, forgive me for my sins, 'cause here I come\n\n[Refrain]\nLord, I suffered through the years\nAnd shed so many tears\n(I've shed so many tears, don't wanna cry no more)\nGod, I lost so many peers\nAnd shed so many tears\n\n[Verse 4]\nLord knows I tried, been a witness to homicide\nSeen drive-by's takin' lives, little kids die\nWonder why as I walk by\nBrokenhearted as I glance at the chalk line, gettin' high\nThis ain't the life for me, I wanna change\nBut ain't no future bright for me, I'm stuck in the game\nI'm trapped inside a maze\nSee this Tanqueray influenced me to gettin' crazy\nDisillusioned lately, I've been really wantin' babies\nSo I could see a part of me that wasn't always shady\nDon't trust my lady 'cause she's a product of this poison\nI'm hearin' noises, think she's fuckin' all my boys\nCan't take no more, I'm fallin' to the floor\nBeggin' for the Lord to let me in to Heaven's door\nShed so many tears\n\n[Refrain]\nGod, please let me in\nLord, lost so many peers\nAnd shed so many tears\n(I've shed so many tears, don't wanna cry no more)\nI suffered through the years\nAnd shed so many tears\n(I've shed so many tears, don't wanna cry no more)\nI lost so many peers\nAnd shed so many tears\n\n[Outro]\nBaby, baby, don't cry\nBaby, baby, dry your eyes for me\n(I suffered through the years, and shed so many tears)\nBaby, baby, don't cry (I shed so many tears)\nBaby, baby, dry your eyes for me (Don't wanna cry no more)\n(I lost so many peers, and shed so many tears)\nBaby, baby, don't cry (I shed so many tears)\nBaby, baby, dry your eyes for me\n(I suffered through the years, and shed so many tears)\nBaby, baby (I shed so many tears)\nBaby, baby (Don't wanna cry no more)", "image": "https://images.genius.com/5130b75fe38a41717da683a432abfd48.600x600x1.jpg"}], "artist": "2Pac"}