{"songs": [{"title": "World Wide Mob Figgaz (Alt OG)", "album": null, "year": null, "lyrics": "[Sample from Goodfellas Movie]\n\n[Verse 1: E.D.I. Mean]\nWorld wide better understand us\nWe comin' with thugs from LA to Atlanta\nPut ya hands up\nNuttin but love from all sides for my thug clique\nOutlaw riders, them haters ain't touchin' this\nHittin' them up in two double O 2\nI got dank, drank, bang, what you wanna do?\nMove out the way you see us comin' through\nIt ain't game it's true, we about to act a fool\nYou know the history\nAll out, ball out, picture me\nBallin' and holding all grands for the victory\nE.D.I. Mean you know the name don't remember me\nSince it's not, sense world wide\n\n[Sample from Goodfellas Movie]\n\n[Verse 2: 2Pac]\nKnown for doin' scandalous deeds, no handlin' me\nAnd nah, it ain't the drugs, it's the straight thug nigga in me\nI swoop down and cause havoc\nMy rappin' delivery is automatic, lettin' niggas have it\nI've been labeled as a thug nigga\nSince they don't sell my shit to white folks\nShip it to the drug dealers\nAnd catch a, catch a nigga world wide\nA fuckin' mob figure West coast who-ride\nWhen we rob niggas money made my squad bigger\nBut we ain't sell our souls\nBustin' on my enemies, murder my foes\nAt my shows I'm a nut, lights camera time for action\nNow get to clappin' to my cuts\n\n[Sample from Scarface Movie]\n\n[Verse 3: Napoleon]\nIt's so hard on me, girl pardon me\nI got the same spirit 'Pac had in him in me\nWhen I mob on the dancefloor, I'm humpin' on floor\nIt's world wide mob thang and that's for sure\nGot money in my pocket now drivin' in a rocket now\nNever hear me rap about ice, I keep it underground\nO-U-T,-L-A-W-Z for sheeze\n\"Y'all tryna start the East-West beef again?\" Girl, please\nGet your money young soldier, time steady wastin'\nI been around the world before, I mean Jamaica\nTO, BO, Bahamas plus Cuba\nLA to Va (World Wide)\n\n[Sample from The Godfather 2 Movie]\n\n[Verse 4: Young Noble]\nI be the Young N-O, to the B-L-E\nLast name O-U-T-L-A-W-Z\nAnd I'm still dirty dirt reppin' Outlaw records\nGet your dough up, dog, get your flow up\n'Pac and Yak live on, don't be surprised if they show up\nAt ya front door with a loaded \"OH NO!\"\nYoung Noble hit the block, what's poppin' homie?\nYou can hate but you know 'Pac watchin' homie\nSo get some love up, we stay thuggin' it up\nLittle homie, is you thuggin' or what?\nThrow yo dubs up, put 'em real high\nEast, West, dirty South, North side, Outlaw pride\n\n[Sample from Scarface Movie]", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}