{"songs": [{"title": "Visions of Me Dead (REMIX)", "album": null, "year": "2015-11-19", "lyrics": "[Intro]\n\n[Verse 1: 2Pac]\nGod bless the dead, and buried\nNigga, don't worry\nIf you see God first\nTell him shit got worse\nI ain't mad\nI know you representing the crew\nAnd I can picture you in heaven with a blunt and a brew\nFuck the world, pain was a part of the game\nIf you a baller, money went as quick as it came\nMy role models - gone or they locked in the pen\nStraight hustlers, caught up in the whirlwind\nThe other day, I thought I seen my homeboy Biggy\nSaying shit don't stop nigga no pity\nWe all hoods, and all we ever had was dreams\nMoney making motherfuckers plot scandalous schemes\nIn the gutter, you learn to have a criminal mind\nI was addicted to trying, never meant to do time\nMy epitaph, will read, was the last of G's\nKicked the shit to make the white man bleed\nGod bless the dead\n\n[Hook: 2Pac]\nI see visions of me dead, lord are you there?\nA closed casket at my funeral, and no one's there\nIs there a heaven for a killer? I change my ways\nAnd every day, I'm a hustler, getting paid\nI see visions of me dead, lord are you there?\nA closed casket at my funeral, and no one cares\nIs there a heaven for a G?\nI'm telling you now, you motherfuckers don't know me\n\n[Verse 2: 2Pac]\nThe motherfucking dust kicker, who can you trust?\nDo have you the heart to see a nigga\nBefore you bust?\nMy name is spoken on the tongues of so many foes\nBusting motherfuckers out the box, I ain't even gone\nNow how the hell do you explain, my claim to fame\nFrom doing flicks to busting tricks out the fucking frame\nGot these bitches on my jock, niggas on my block\nJealous ass suckers, got em ducking from my smoking Glock\nAnd busting niggas asses to stay alive\nSkinny ass player watching bigger motherfuckers fry\nThey ask me how I’m living? I’m a hustler\nBucking busters, 'til they die\nNow it's on in the ghetto, you ain't heard?\nNiggas got they AK’s heading for the burbs\nAiming at them skin-head bitches let it rain\nGiving em a wet welcome to the house of pain!\n\n[Hook: 2Pac]\nI see visions of me dead, lord are you there?\nA closed casket at my funeral, and no one's there\nIs there a heaven for a killer? I change my ways\nAnd every day, I'm a hustler, getting paid\nI see visions of me dead, lord are you there?\nA closed casket at my funeral, and no one cares\nIs there a heaven for a G?\nI'm telling you now, you motherfuckers don't know me\n\n[Verse 3: 2Pac]\nBut still I'm having memories of high speed when the cops crashed\nAs I laugh, pushing the gas while my Glocks blast\nWe was young and we was dumb, but we had heart\nIn the dark, will we survive through the bad parts?\nMany dreams is what I had, and plenty wishes\nNo hesitation in extermination of these snitches\nEnvious bitches, they still continue to pursue me\nA couple of movies, now the whole world's trying to screw me\nEven the cops tried to sue me, so what can I do?\nBut stay true, sipping 22's of brew\nAnd now media is trying to test me\nGot the press asking questions, trying to stress me\nMisery is all I see, that's my mind state\nMy history with the police will shake the crime rate\nMy main man had two strikes, slipped, got arrested and flipped\nTwo- Two strikes slipped got arrested and flip\nHe screamed \"thug life\"\n\n[Hook: 2Pac]\nI see visions of me dead, lord are you there?\nA closed casket at my funeral, and no one's there\nIs there a heaven for a killer? I change my ways\nAnd every day, I'm a hustler, getting paid\nI see visions of me dead, lord are you there?\nA closed casket at my funeral, and no one cares\nIs there a heaven for a G?\nI'm telling you now, you motherfuckers don't know me", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}