{"songs": [{"title": "Lost Souls (Nu-Mixx)", "album": "Nu Mixx Klazzics Vol. 2 (Mixtape)", "year": "2007-08-14", "lyrics": "[Intro: 2Pac]\n'Cause I hate to spend\nMy life, my life, my life, my life\nDuckin' one-time! (Lost Soul)\nHow it start? How it start?\n\n[Verse 1: 2Pac]\nStarted off with, runnin' from coppers\nDuck and hide from helicopters\nWe open fire, who can stop us?\nLivin the life of trife juveniles, hopin' for Rikers\nGettin' 25 to life, if the judge don't like us\nAm I clear as pictures? I see authorities itchin' to get us\nATF, state feds, scandalous bitches\nHow was it promised to us? Was it bitter or sweet?\nSee if a, nigga don't hustle then a nigga don't eat\nOn these streets livin' do or die, circle complete\nRepetitive motions and felons in the rush for G's\nPlease understand my history a man of many acts\nLivin' Thug Life, comin' equipped, with plenty gats\nMaybe I was just a lost soul, trapped in time\nLivin' in between life, and the cracks were blind\nEven though we had hope for dreams that never came\nYet and still we all feel pain\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time; stranded in the county in the worst way\nHell of a way to spend my twenty-first birthday\nBorn in the ghetto as a street thug\nIt's for the neighborhood and weed spots that we love\nLost souls...\nLost souls, nigga, for my homeboys that passed on\nWords from the mind of a lost soul\n\n[Chorus: 2Pac]\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time\nRoll wit' it, nigga; roll wit' it, nigga\n\n[Verse 2: Young Noble]\nMy brother Sean, first on my list, he came home\nWent back in and came back home again\nAnd he just violated parole\nNow Uncle Sam wants the time he owed\nBack to the system, Black and trapped in a prison\nI miss him, it's just my brother don't listen to nobody\nHe hardheaded, stuck in his ways\nWon't change for nobody, all I could do is pray for him\nAnd I'm praying for myself\nTrying to beat the odds with the cards that we was dealt\nYoung niggas need help, the suicide rate is up higher than ever\nRest in peace to granny, send my love to KRS and the family\nWe need to try to make it through the struggle as family\nThey say rapping don't pay them bills\nTrappin' gon' pay them bills 'cause this ain't how we tryna live\n\n[Chorus: 2Pac]\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time\nOne time, one time, one time\n\n[Verse 3: EDI Mean]\nI've been waiting on the rain to turn to sunshine for a long time\nStuck up on this grind, still want mine\nLost a couple homies, miss some comrades\nBut ain't no looking back when you gotta keep it crackin'\nJust had another birthday, guess I'm lucky\nTriple 7's, momma's still here to hug me\nMy baby on the way, she need a whole lot\nShe gon' get what she need, that's on pops\nI used to love the shit, but man, the shit changed\nIt's a shame, niggas paid to be lame\nBut, uh, some of the realest, some people give it up\nLost souls around the world looking for love\nI'm forever thuggin' on them hoes, right or wrong\nThug life embedded in me 'til I'm dead and gone\nIt's in my heart, in my flesh, in my soul\nI used to be lost but now I know\n\n[Chorus: 2Pac]\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time\nJust wait until rain turn to sunshine\n'Cause I hate to spend, my life, my life, my life, my life\nDuckin' one-time\n\n[Outro: 2Pac]\nAll of y'all, keeping y'all in health\nAll of y'all, keeping y'all in health\nJust to see you smile and enjoy yourself\nFor all of y'all, keeping y'all in health\nJust to see you smile and enjoy yourself\nFor all my dogs, keeping y'all in health\nJust to see you smile and enjoy yourself\nFor all my dogs, keeping y'all in health\nJust to see you smile and enjoy yourself\nFor all my dogs, keeping y'all in health\nJust to see you smile and enjoy yourself\nThrow your hands up, throw your hands up\nThrow your hands up, throw your hands up\nIt's for all my dogs, keeping y'all in health\nJust to see you smile and enjoy yourself...", "image": "https://images.genius.com/3df7ac2293876c8e607489cd6238694a.220x220x1.jpg"}], "artist": "2Pac"}